{
  "data": [
    {
      "pid": "AttractionProductReview-g293890-d11469615-Nagarkot_Sunrise_View_and_Day_Hiking_from_Kathmandu-Kathmandu_Kathmandu_Valley_Bag",
      "name": "Nagarkot Sunrise View and Day Hiking from Kathmandu",
      "price": "from $85.00 per adult (price varies by group size)",
      "location": "Nagarkot, Kathmandu",
      "about": "A mountain village in Nepal, Nagarkot is famous for its sunrise views over the Himalayas. On this tour from Kathmandu, enjoy an early morning panorama over world-renowned peaks before a scenic hike to Changu Narayan. Visit other villages as you make your way through the country’s picturesque hillsides before arriving at the UNESCO-listed temple. A private guide means plenty of personal attention, and hotel pickup makes for a seamless experience.The trip was good but harder than we expected. We were told it would be downhill, but there were some challenging uphill parts. The hike was described as easy, while it may be an easier hike in this area, it was much more challenging for us as tourists than we expected. Madan was helpful, encouraging and willing to slowdown and help up navigate the tougher parts of the trails. Our driver was great at navigating the fog in the morning and the traffic in the afternoon. Although we couldn’t see the mountains at sunrise, it was still a great experience and worthwhile view. Overall, it was a good day, but we think the description of the hike could be a little more accurate. Nepali ‘easy’ is very different than American ‘easy’. It ended up being over 7miles from the start of the official hike to the end with a significant ‘hill’ we had to hike up in the middle.Namaste Elizabeth,\n\nThank you very much for sharing your review. We are sorry that you found this hiking journey to be difficult and couldn't witness mountains at sunrise. But we would love to welcome you back again with easier tours in Nepal. We are glad that our guide Madan was very helpful. Have a nice time!Very good hike with beautifull view and sunrise! Very good guide, Somnath, and the hike was good length, not too long. Thank you!Namaste Esben,\n\nThank you very much for sharing your review. Glad to know that you loved this trip with our guide Somnath. Love to welcome you back again. Have a nice time!Our guide Shishir took us through a beautiful path across Nagarkot. We experienced great terrain, culture and a beautiful Buddhist Garden.Namaste Meenu,\n\nThank you very much for sharing your review. Glad to know that you loved this trip with our guide Shishir. Love to welcome you back again. Have a nice time!Today I went on a sunrise and hiking trip to Nagarkot. The trip was perfectly organized and my guide Shishir was just perfect. He speaks English fluently and he has an enormous knowledge about nature, history, religion and culture.  It was a pleasure talking to him.  I can recommend this trip to everybody. Namaste!\n\nThank you very much for sharing your review. Glad to know that you loved this trip our guide Shishir. Love to welcome you back again. Have a nice time!The sunrise view was good, but the best part was the walk through the nearby villages and stops at the temples. Was a great chance to glimpse a side of nepal outside the city and trekking.Namaste!\n\nThank you very much for sharing your review. Glad to know that you loved the hiking part with our guide. Love to welcome you back again. Have a nice time!Not as advertised - the lookout point is dangerous at best.  The hike through picturesque villages is non-existent.  No places to stop and see the vistas.  No places to eat and mingle as advertised.  Guide was on phone most of the time.  Complete waste of moneyHi Aaron,\n\nThank you very much for your superb feedback about the trip and we are sorry for the any inconvenience. Regarding the view we can not guarantee for weather clearance, it is depend on a season and i am sure your day has a poor visibility. Besides this we are well concerned about the guide service. He did a thousand of trip not sure why he was not caring you. We will take necessary action and aware him for his upcoming duty and we trust that this won't be happen again. Have a nice stay in Nepal. Namaste!Walked about 13 kms through different villages. The guide knew the area very well. The breakfast after the sunrise was at a wonderful hotel with fascinating views. Pick up and drop was as sceduled. No delayes. Madan is a good asset for a company. I felt how he felt responsible during whole tour and explained the details without hesitation. Thank you once againHi Eka,\n\nThank you very much for being with us and glad to know you loved this trip with our guide Madan. If you feel longer trip in future feel free to contact us and we would love to serve you again. Namaste!A huge thanks to our tour guide Shishir and driver Sundes ! We had a magical time watching the sunrise. Shishir even brought us some wild raspberry’s! I am the type of person who likes to watch the sunrise for a long time so I was very grateful that he never hurried us for the next schedule and let us stay to watch the sunrise for the longest time.Unfortunately we couldn’t see the Himalayan mountains but it was still a very nice sunrise.Also the hiking was a wonderful adventure where we saw many dogs, goats and chickens and really see the village life.He explained a lot of the scenery with many interesting facts. Unfortunately after hiking for a while I was suddenly feeling unwell and nearly fainted.Shishir asked our driver Sundes to come to the closest point available to pick us up and helped me go to a local cafe to lie down for a while.I really appreciate their help and their kindness. If not for the two of them, me and my friend wouldn’t have felt safe.They made our first trip to Kathmandu very very special despite feeling unwell. Thankyou so much and hope to see u again soon!!Namaste!\n\nFirst of all thank you for choosing us as your local operator here in Kathmandu and glad to know our guide able to offer you good service and information. Your safety is our first concern and glad to know our guide able to provide you on time service while needed. We love to serve you again in the future. Have a nice time in Nepal. Namaste!Our day in Nagarkot with Pankaj was one of the best day trips we’ve ever had! Pankaj is kind, intelligent, patient and interesting. We learned so much! Three of us signed up and we were surprised to find out we had Pankaj to ourselves all day! This trip is an excellent value. The highlight was spending time talking with Pankaj while walking through the hill villages on the way down from a wonderful breakfast that followed the sunrise. We will never forget this day.Hi Nancy,\n\nThank you very much for taking an Himalayan walking experience with us. Glad to know Pankaj made your best experience for you. We are extremely looking forward to serve you next time for longer holidays that we have specilized best Nepal trekking here. Have a nice time. Namaste!Great view of the sunrise on the morning and a nice walk after with a great tour guide and interesting tour of temple. Hi,\n\nThank you for sharing your experience and glad that you loved this trip. we are extremely looking for future trip in Nepal again. Namaste!",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/74/9d/df.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/08/81/e9/ad.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/74/9d/e0.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 11-70"
        },
        {
          "svg": "",
          "name": "Duration: 9h"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [
        "A sunrise Nagarkot trip with Changu Narayan hike",
        "Enjoy panoramic views over the Himalayas, followed by a gentle guided hike",
        "Stop along the route to enjoy local Newari delicacies in family-run shops",
        "Spend time exploring the UNESCO-listed temple that most visitors miss"
      ],
      "extra": [
        {
          "title": "What's included",
          "text": "Professional guideTransportation (hotel pickup & drop, air conditioned vehicle)Fees (admission, fuel surcharge, parking, entry)Entry/Admission - Nagarkot View TowerEntry/Admission - Changu NarayanFood and drinksGratuities"
        },

        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.We pick up from all hotels inside ring road including Boudha area, Bhaktapur and Nagarkot area. Airports:Tribhuvan Airport, Kathmandu NepalHotel pickup is offered. View the hotel list on our checkout page to see if yours is included among the pickup points.Returns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleInfants must sit on laps"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingIn the event of poor weather or bad traffic conditions, tour itinerary is subject to change without notice. No cancellations or refunds will be issued. See voucher for detailsWe recommend you bring warm clothing during winterNot recommended for travelers with back problemsNot recommended for pregnant travelersNo heart problems or other serious medical conditionsMost travelers can participateThis is a private tour/activity. Only your group will participate"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "FAQ",
          "text": "Changu NarayanNagarkot View TowerThamel"
        },
        {
          "title": "Help",
          "text": "If you have questions about this tour or need help making your booking, we’d be happy to help. Just call the number below and reference the product code: 7670P7"
        }
      ],
      "itinerary": [
        {
          "title": "Nagarkot View Tower",
          "text": "Stop: 10 minutes  "
        },
        {
          "title": "Nagarkot Buddha Peace Park Hiking Trail",
          "text": "Stop: 30 minutes - Admission included"
        },
        {
          "title": "Changu NarayanPass by",
          "text": ""
        },
        {
          "title": "You'll return to the starting point",
          "text": ""
        }
      ],
      "reviews": [
        {
          "name": "Elizabeth S",
          "text": "The trip was good but harder than we expected. We were told it would be downhill, but there were some challenging uphill parts. The hike was described as easy, while it may be an easier hike in this area, it was much more challenging for us as tourists than we expected. Madan was helpful, encouraging and willing to slowdown and help up navigate the tougher parts of the trails. Our driver was great at navigating the fog in the morning and the traffic in the afternoon. Although we couldn’t see the mountains at sunrise, it was still a great experience and worthwhile view. Overall, it was a good day, but we think the description of the hike could be a little more accurate. Nepali ‘easy’ is very different than American ‘easy’. It ended up being over 7miles from the start of the official hike to the end with a significant ‘hill’ we had to hike up in the middle.Namaste Elizabeth,\n\nThank you very much for sharing your review. We are sorry that you found this hiking journey to be difficult and couldn't witness mountains at sunrise. But we would love to welcome you back again with easier tours in Nepal. We are glad that our guide Madan was very helpful. Have a nice time!"
        },
        {
          "name": "Esben M",
          "text": "Very good hike with beautifull view and sunrise! Very good guide, Somnath, and the hike was good length, not too long. Thank you!Namaste Esben,\n\nThank you very much for sharing your review. Glad to know that you loved this trip with our guide Somnath. Love to welcome you back again. Have a nice time!"
        },
        {
          "name": "Meenu Chandra",
          "text": "Our guide Shishir took us through a beautiful path across Nagarkot. We experienced great terrain, culture and a beautiful Buddhist Garden.Namaste Meenu,\n\nThank you very much for sharing your review. Glad to know that you loved this trip with our guide Shishir. Love to welcome you back again. Have a nice time!"
        },
        {
          "name": "PETRA L",
          "text": "Today I went on a sunrise and hiking trip to Nagarkot. The trip was perfectly organized and my guide Shishir was just perfect. He speaks English fluently and he has an enormous knowledge about nature, history, religion and culture.  It was a pleasure talking to him.  I can recommend this trip to everybody. Namaste!\n\nThank you very much for sharing your review. Glad to know that you loved this trip our guide Shishir. Love to welcome you back again. Have a nice time!"
        },
        {
          "name": "Explore286869",
          "text": "The sunrise view was good, but the best part was the walk through the nearby villages and stops at the temples. Was a great chance to glimpse a side of nepal outside the city and trekking.Namaste!\n\nThank you very much for sharing your review. Glad to know that you loved the hiking part with our guide. Love to welcome you back again. Have a nice time!"
        }
      ],
      "rate": "5.0239 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d11469615-Nagarkot_Sunrise_View_and_Day_Hiking_from_Kathmandu-Kathmandu_Kathmandu_Valley_Bag.html",
      "categoryId": "6463c2109ae7fcd265eb30cd"
    },
    {
      "pid": "AttractionProductReview-g1367591-d19422647-Jungle_Towernight_Stay_In_Chitwan_National_Park_nepal_2_Nights_3_Days_Package-Sau",
      "name": "Jungle Towernight Stay In Chitwan National Park ,nepal-2 Nights 3 Days Package",
      "price": "from $225.65$203.08 per adult",
      "location": "Chitwan",
      "about": "After the  busy Katmandu, coming here to The Park and staying with Sangam at the resort has been something I will always remember. 10/10 experience like no other. Thankyou to Repal my expert jungle guide and his security guide. This will rate amongst my top trips ever. The animals and the national park are majestic!Dear James ,   \n\nNamaste  \n\nThank you for choosing The towernight stay with us .  \n\nThank you for the amazing review . \n  \nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us .  \n\nConnecting with you was memorable through the jungle tour .  \n\nSee you soon in near future  \n\nRegards\nSangamThe opportunity to get up close and personal with the river and jungle environment and it's species made this a much richer experience we went down river for 45 minutes seeing a variety of birds and crocodiles. Redis embarked and hiked on trail 45 minutes seeing a massive rhinoceros eating grass next to the trail. The tower itself is exactly correct. A three-story structure embedded in the jungle. We observe multiple bird species. Monkeys in the trees fell asleep to the sounds of the forest. Highly recommendedDear Michael ,   \n\nNamaste  \n\nThank you for choosing The towernight stay with us .  \n\nThank you for the amazing review . \n  \nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us .  \n\nConnecting with you was memorable through the jungle tour .  \n\nSee you soon in near future  \n\nRegards\nSangamThe experience has been very very good. In fact, I can say that it has been beyond my expectations! I want to thank the hole crew that has been involved in our experience because it could not have been any better! We saw all kind of wild animals, from all kind of birds to crocodriles and rhinos! We stayed slept overnight in the middle of the jungle and did jeep safari. Saw deers, rhinos, monkeys, elephants, etc.I would no doubt recommend it!!! Thank you!Dear Henry,   \n\nNamaste  \n\nThank you for choosing The towernight stay with us .  \n\nThank you for the amazing review . \n  \nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us .  \n\nConnecting with you was memorable through the jungle tour .  \n\nSee you soon in near future  \n\nRegards\nSangamOnce in a lifetime experience with rhinos in the wild, crocs, elephants and countless other species.Dear Guy ,   \n\nNamaste  \n\nThank you for choosing The towernight stay with us .  \n\nThank you for the amazing review . \n  \nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us .  \n\nConnecting with you was memorable through the jungle tour .  \n\nSee you soon in near future  \n\nRegards\nSangamThis tour was very well organised with excellent communication via WhatsApp to inform us of arrangements for catching bus from Kathmandu and being met at Chitwan. Lovely accommodation, attentive staff, good and plenty food, well organised jungle walk, canoe ride, jeep safari and Towernight stay with a most experienced safari guide, Hermanta who ensured we saw plenty of animal and bird life! Would highly recommend this tour package!!!Dear Deborah ,   \n\nNamaste  \n\nThank you for choosing The towernight stay with us .  \n\nThank you for the amazing review . \n  \nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us .  \n\nConnecting with you was memorable through the jungle tour .  \n\nSee you soon in near future  \n\nRegards\nSangamAbsolutely sensational!! From the moment I enquired about this package there has been fabulous communication, excellent scheduling, friendly service that I cannot fault. The bus to and from Chitwan was organised and I boarded without any fuss. Accomodation is lovely! Amazing, friendly, helpful staff who have your every need and comfort their upmost priority. Nothing is ever a bother. The jungle tower is gorgeous. Just for that reason, don’t hesitate, you should book this package!!! Right on the rivers edge. You won’t find another similar. A variety of wildlife literally on the doorstep. What more could you ask for! Delightful and extremely knowledgeable guides A+++ Jeep jungle safari for sure a highlight, rhinos (amongst much other wildlife) galore. Tharu cultural show. Also not one to miss! Couldn’t be more impressed by the stay! Well worth every penny. Has everything you want to see in Chitwan included. Thank you very much for having me. Highly recommend 10/10Dear Guests , \n\nNamaste\n\nThank you for choosing The towernight stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangamSungam is the best!!! He arranged everything for us so we could have the most perfect stay in Chitwan. The hotel rooms were very nice and comfy, and the food was so delicious! The customer service was truly incredible that we received including all the extra cut up watermelon. Additionally, all the jungle activities arranged were spectacular. Our guide Gopa was the best guide ever. He had such an incredible eye for spotting wildlife and was such a kind soul and had an awesome energy about him. Gopa was so knowledgeable and the best guide in chitwan- he made us feel safe and helped us appreciate the nature with all his fun facts and incredible spirit. We loved Gopa and the jungle safaris including the boat, walking tour, jeep and incredible night in the jungle tower. This was truly a once-in-a lifetime experience and I would come back again in a heartbeat with this same company and Gopa. If you want to have the most incredible experience in Chitwan, Sungam is your guy to ensure that! A special shoutout to Sungam for all the extra stuff he arranged for us, including an elephant safari, we sincerely appreciated it! Dear Katie , \n\nNamaste\n\nThank you for choosing The towernight stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangamExcellent package. The guide, goka, was extremely knowledgeable. We took a bus from Kathmandu to Chitwan, and the owner was very responsive about some changes we wanted to make.We stayed in the tower that was closest to the river. The accommodation comes with a western toilet and mosquito nets. We woke up at 3:30am to sounds of rhinos fighting right outside the tower. Needless to say, the nature aspect of the trip was incredible. Highly recommend. Dear Ben , \n\nNamaste\n\nThank you for choosing The towernight stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangamA fantastic way to experience the park and actually stay inside overnight. Rhinos, tigers and bears! The guide was excellent, everything was well organized, would definitely recommend! Dear James , \n\nNamaste\n\nThank you for choosing The towernight stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangamHad the most staying time with the Jungle Safari Resort in Chitwan.The staff, food and accommodations were top notch. The canoe, walking and Jeep safaris offered varied experiences that were all amazing and gave me a chance to see the many wonders of Chitwan. My favorite part was staying in the tower. The tower gave me a chance to see rhino, crocs, birds and even a tiger! I can’t recommend Jungle Safari Resort enough. Next time I come to Chitwan, I will definitely stay with them!Dear Guests , \n\nNamaste\n\nThank you for choosing The towernight stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangam",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/a8/ea/7b.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/a5/5e/c6.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/11/88/5d/a1.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 0-100, max of 8 per group"
        },
        {
          "svg": "",
          "name": "Duration: 3 days"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        },
        {
          "svg": "",
          "name": "Features animals"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "Jeep SafariCanoe Ride (Boating )Experience Nature GuideJungle Walk + Bird Watching (As per guest interest )All Meal ( 2 Lunch , 2 Dinner , 2 Breakfast )All Fees and TaxesAir-conditioned vehicleAccommodations ( 1 Nights in Jungle Tower & 1 night in Deluxe Hotel rooms )Alcoholic BeveragesPrivate transportationJungle safari clothes ( dark colour clothes : leaf green , brown , grey ) "
        },

        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.We provide Transportation Service in Tourist coach from Kathmandu , Chitwan. or Pokhara . We have our representative in all three main city of Nepal . \nThe pick up time is mentioned in 24 hr , because we want to meet clients 1 day before explain all details individually , so that it will be more experience for clients . Jungle Safari Resort, Sauraha, Ratnanagar 44200, Main Road Sauraha, Chitwan Nepal 44200, Nepal\nWe provide pick up from Kathmandu , Chitwan. or Pokhara . We have our representative in all three main city of Nepal . \n\nWe have tourist coach from Kathmandu and Pokhara . \nThe coach tickets is included in the price\nAirports:Bharatpur Airport, Bharatpur NepalPorts:Tourist Bus Stop, Nayabazar 16, Kathmandu 44600, NepalOther:Tourist Bus Stop, Nayabazar 16, Kathmandu 44600, Nepal\nWe have daily air-conditioned tourist coach from Kathmandu to Chitwan . Once you book the trip we send you the bus tickets and details . Returns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleNear public transportationInfant seats available"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingNot recommended for pregnant travelersNo heart problems or other serious medical conditionsMost travelers can participateThis experience requires good weather. If it’s canceled due to poor weather, you’ll be offered a different date or a full refundThis tour/activity will have a maximum of 8 travelers"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },

        {
          "title": "Help",
          "text": "If you have questions about this tour or need help making your booking, we’d be happy to help. Just call the number below and reference the product code: 216402P1"
        }
      ],
      "itinerary": [],
      "reviews": [
        {
          "name": "James Kenneth W",
          "text": "After the  busy Katmandu, coming here to The Park and staying with Sangam at the resort has been something I will always remember. 10/10 experience like no other. Thankyou to Repal my expert jungle guide and his security guide. This will rate amongst my top trips ever. The animals and the national park are majestic!Dear James ,   \n\nNamaste  \n\nThank you for choosing The towernight stay with us .  \n\nThank you for the amazing review . \n  \nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us .  \n\nConnecting with you was memorable through the jungle tour .  \n\nSee you soon in near future  \n\nRegards\nSangam"
        },
        {
          "name": "Michael K",
          "text": "The opportunity to get up close and personal with the river and jungle environment and it's species made this a much richer experience we went down river for 45 minutes seeing a variety of birds and crocodiles. Redis embarked and hiked on trail 45 minutes seeing a massive rhinoceros eating grass next to the trail. The tower itself is exactly correct. A three-story structure embedded in the jungle. We observe multiple bird species. Monkeys in the trees fell asleep to the sounds of the forest. Highly recommendedDear Michael ,   \n\nNamaste  \n\nThank you for choosing The towernight stay with us .  \n\nThank you for the amazing review . \n  \nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us .  \n\nConnecting with you was memorable through the jungle tour .  \n\nSee you soon in near future  \n\nRegards\nSangam"
        },
        {
          "name": "Henry",
          "text": "The experience has been very very good. In fact, I can say that it has been beyond my expectations! I want to thank the hole crew that has been involved in our experience because it could not have been any better! We saw all kind of wild animals, from all kind of birds to crocodriles and rhinos! We stayed slept overnight in the middle of the jungle and did jeep safari. Saw deers, rhinos, monkeys, elephants, etc.I would no doubt recommend it!!! Thank you!Dear Henry,   \n\nNamaste  \n\nThank you for choosing The towernight stay with us .  \n\nThank you for the amazing review . \n  \nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us .  \n\nConnecting with you was memorable through the jungle tour .  \n\nSee you soon in near future  \n\nRegards\nSangam"
        },
        {
          "name": "Guy S",
          "text": "Once in a lifetime experience with rhinos in the wild, crocs, elephants and countless other species.Dear Guy ,   \n\nNamaste  \n\nThank you for choosing The towernight stay with us .  \n\nThank you for the amazing review . \n  \nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us .  \n\nConnecting with you was memorable through the jungle tour .  \n\nSee you soon in near future  \n\nRegards\nSangam"
        },
        {
          "name": "Deborah P",
          "text": "This tour was very well organised with excellent communication via WhatsApp to inform us of arrangements for catching bus from Kathmandu and being met at Chitwan. Lovely accommodation, attentive staff, good and plenty food, well organised jungle walk, canoe ride, jeep safari and Towernight stay with a most experienced safari guide, Hermanta who ensured we saw plenty of animal and bird life! Would highly recommend this tour package!!!Dear Deborah ,   \n\nNamaste  \n\nThank you for choosing The towernight stay with us .  \n\nThank you for the amazing review . \n  \nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us .  \n\nConnecting with you was memorable through the jungle tour .  \n\nSee you soon in near future  \n\nRegards\nSangam"
        }
      ],
      "rate": "5.032 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g1367591-d19422647-Jungle_Towernight_Stay_In_Chitwan_National_Park_nepal_2_Nights_3_Days_Package-Sau.html",
      "categoryId": "6463c2109ae7fcd265eb30cd"
    },
    {
      "pid": "AttractionProductReview-g293890-d13166235-Everest_Base_Camp_Trek_14_Days-Kathmandu_Kathmandu_Valley_Bagmati_Zone_Central_Reg",
      "name": "Everest Base Camp Trek - 14 Days",
      "price": "from $1,500.00 per adult",
      "location": "Solukhumbu",
      "about": "We had a fantastic time during this trek in off-season. We wanted to make sure to pick a Nepali company, all the admin was arranged making it super easy for us and our guide Pasang and porter Gombu were perfect calm company and supported us with absolutely everything the whole way, perhaps it’s possible to ask for their services when you book. Big recommendation and we’ll come again! Had an amazing time trekking to EBC with Ace The Himalaya. Both our guide Pasang and porter Gombu made this trek unforgettable and were very caring during the 14 days !!We decided to go off season to avoid too much crowd and although not sunny at all times, much recommended!Overall, very very good experience When I decided to embark my journey for Everest Base Camp, the so called EBC Trek, I wanted to make sure about the quality of organisers and did extensive research to figure out so many positive reviews about ACE the Himalayas. It was a group trek which taught me how to be the part of group which had 2 Americans, 2 Britishers, 2 Iranians, 2 Canadians , 2 Romanians and 2 IndiansFor someone who always believes it’s all about mindset and I could complete it without any preparation, I would surely call it moderate to difficult trek both mentally and physically, considering the 5K+ altitudeFrom landing on worlds most dangerous airport Lukla 🛫to Phakding to have fooseball game ⚽️with beers 🍻to Namche Bazar along with Everest view Hotel Trek 🏞️to Tighboce where we had our first sight of mightly Mt Everest 🏔️and Lohtseto Dingboche to have some awesome coffee ☕️ to hike to Nangkartshang Peakto Labuche to feel the atmosphere with super thin air and able to survive the same 🥶❄️to Gorak Shep to drop our bags to reach EBC and witness the world mightiest Mountain EVEREST also from Kala Patthar 🥾All of this makes EBC trek one of best and most memorable adventures of my lifeCheers to all fellow hikers for reaching new heights both on mountains and in our personal lives. See you soon matesPS: Thanks to our Guide Raj and Assistant Guide Dilip who were patient enough to tell names of all the peaks again and again and made this trek possible 🙂Raj had great knowledge about medication, equipment and weather. When a few members of our trip fell sick his team took care of them to the highest. He and his team always ensure our safety and comfort. I never felt it was rushed at any moment as you can imagine during any organised tripDilip has all the qualities of becoming a trek leader soon and all the very best brotherPS: Special thanks to all our sherpas who made it possible by carrying our duffle bags so that we could sleep comfortably during the entire trek 🫡When you plan such a lifetime experience, you definitely need a team like Ace, I wish ACE team a big Thank You as because of your guys 12 people have been able to ACE the Himalayas EBC Trek :)A GREAT EXPERIENCE our guide Aamod Nepal and Poter kumar were wonderful, kind and patient with us. We had a good experience Amod went at our pace which was great. We were taken great care off from our arrive until our departure excellent service and care. All questions were answered to the best of their ability.Thank you guys.I recently had the opportunity to embark on a mesmerizing 14-day trek to Everest Base Camp with the exceptional team at Ace the Himalaya. Our guide, Pasang, was an absolute gem, sharing captivating stories and ensuring our safety. Special shoutout to the porters Gopal, Hem and Ihakpa who amazed us with their strength and kindness. The organization was flawless, with comfortable accommodations and delicious meals. This trek was truly remarkable, exceeding all expectations. I highly recommend Ace the Himalaya for an unforgettable Himalayan adventure.I have only good things to say about my experience trekking to EBC with Ace Himalaya! Our guide Raj and assistant guide Soumun were kind, supportive and patient throughout the trip. We had a mix of ages and experience levels in our group, but throughout the climb we felt supported, encouraged and most importantly we felt safe. When members of our group were feeling sick, Raj and Soumun helped us talk through our symptoms, provided medication and calmed our doubts. Raj had great medical knowledge and equipment and provide us with medication, daily oxygen saturation checks which helped ease some of our tensions. Additionally the guides helped us set a great pace throughout the course of the entire hike, making the harder days feel more manageable. The trek itself was absolutely beautiful! The views were unbeatable and the opportunity to meet people from all over the world during the hike was incredible. This was the trip of a lifetime, so thank you Ace!!I’m not sure where to begin here! There were so many wonderful things about my trek with Ace the Himalaya tour group.  For starters, I am 61 years old and in relatively fit shape.  There’s always room for improvement, as one can never prepare entirely for a huge altitude hike, such as the EBC trek.  This was my first ever altitude trek of this magnitude.Raj, our guide and Narin, our porter were incredibly, kind, respectful patient and knowledgeable.  Raj was funny and certainly knew how to make me feel confident and strong.He even insisted on carrying my day pack, along with his own large backpack many of the tekking days, to save my energy.   Unfortunately, I suffered from altitude sickness and a head cold much of the trek, but continued to trek onward and upward with Raj’s encouragement and belief in me that I could complete this journey, and I did!!!! The views are stunning, the support and camaraderie  among the other trekkers on the trail was inspirational.  Embracing the Nepalese people, food and culture is unforgettable.Look no farther, Ace the Himalaya is your trekking company. They are stellar.  Truly, don’t waste your time looking at other Trekking companies to the EBC.I would definitely go with them again for other treks.  They are highly professional and reasonably priced.I’ve traveled all over the world and have done many different treks along the way. Ace the Himalaya was absolutely brilliant! I loved the attention to detail and the care that was provided to my friend and I. Raj was an extraordinary guide who saw to our every need and gently encouraged us along the way while having fun. Narayan was our gentle and patient porter who went above and beyond his duties. Consider yourself lucky if you get these two men as your guide and porter, they are indeed wonderful! I will never forget this trip to Everest Base Camp and  am already thinking about booking another adventure with Ace in the future! Thank you Raj and the Ace team!Incredible experience. Our guide Nimesh was absolutely fantastic - answered every question we had, was with us 24/7 and helped through every difficulty we encountered. He also gave fantastic tips  that made the hight acclimatization much easier.The organization of the trek was spot on - i never once felt like we were stuck or was lacking for anything. On one of the days when we felt we could walk for more than was planned - Nimesh and ace the himalaya very quickly organized a guesthouse in the next village so we  could continue walking on.Ace the himalaya made sure we also got on the first flights in and out of lukla - seeing as any slight change in weather can cause serious delays, making sure we were booked for the earliest flight made the start and end of the trek as smooth as possible.Ace and Nimesh made sure this was a fantastic experience, and that apart from the walking itself i didn't have to worry about anything.Great Views and Amazing experience. Trek was strenuous, Guides Raj and Souman made it easier.  They provided us with great guidance, clean water and amazing food. Srujan helped us organize the trip and provided great support. Ace the Himalaya is the best!!!",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/07/87/2f/a9.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/0b/91/13/7b.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/0b/91/13/a5.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 8-75, max of 14 per group"
        },
        {
          "svg": "",
          "name": "Duration: 14 days"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "DinnerBreakfastDinnerLunchBreakfastDinnerDinnerBreakfastBreakfastDinnerLunchBreakfastLunchBreakfastLunchLunchBreakfastDinnerLunchDinnerBreakfastBreakfastBreakfastDinnerBreakfastDinnerDinnerDinnerBreakfastLunchDinnerLunchLunchBreakfastLunchLunchAirport/hotel transfers in private tourist vehicle3-star twin-share accommodation in Kathmandu (2 nights); breakfast includedTwin-sharing guesthouse accommodation in the trek with attached toilets in Lukla, Phakding & NamcheFirst-aid trained, government licensed English-speaking trekking guide Porter service for 11 days (1 porter for 2 clients). Food, accommodation, salary, insurance, equipment and medicine for all staffEverest/Sagarmatha National Park entry permit and Pasang Lhamu Rural Municipality fee for trekking. Airfare for Kathmandu-Lukla-Kathmandu sector including airport departure taxAce the Himalaya’s duffel, trekking map, sun hat and trip completion certificate (yours to keep)A comprehensive first-aid kit and arrangements for emergency medical evacuation in worst scenario. All our government taxes, tourist service charges, official expensesFiltered water in the trails using Katadyn Pocket Water FilterSeasonal fruits during the trekAll your standard meals during the trek (Breakfast, Lunch, and Dinner)Lunch and dinner in Kathmandu.Travel insurance covering emergency high-altitude rescue and evacuationInternational airfare and airport departure taxNepal visa which you can get easily upon arrival Alcoholic, hot and cold drinksPersonal trekking equipmentTips for guide and porter. (Tipping is expected.)Any others expenses that are not mentioned in the Included section"
        },
        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.Our airport representative will be waiting for you outside the terminal building holding Ace the Himalaya signboard. Once he receives you, he will direct you our tourist vehicle which will bring you to the hotel. Kathmandu 44600, NepalAirports:Tribhuvan Airport, Kathmandu NepalReturns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleNear public transportation"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of booking The price is for 1 person based on two people booking. It is also valid for a single person booking. However, if we don't have an existing group for your chosen departure date or anyone to share the accommodation with you, a single surcharge of USD 200 is applicable which you need to pay upon your arrival in Nepal. At the time of booking, we will inform you if we have a group or not for your date. The single surcharge is also applicable if you don't want to join any group and want a solo departure. Domestic flight luggage allowance: 15 kgNot recommended for travelers with back problemsNot recommended for pregnant travelersNo heart problems or other serious medical conditionsTravelers should have a moderate physical fitness levelThis tour/activity will have a maximum of 14 travelers"
        },
        {
          "title": "Cancellation policy",
          "text": "If you cancel at least 7 days in advance of the scheduled departure, there is no cancellation fee.If you cancel between 3 and 6 day(s) in advance of the scheduled departure, there is a 50 percent cancellation fee.If you cancel within 2 days of the scheduled departure, there is a 100 percent cancellation fee."
        },
        {
          "title": "FAQ",
          "text": "Tengboche Gompa"
        },
        {
          "title": "Help",
          "text": "If you have questions about this tour or need help making your booking, we’d be happy to help. Just call the number below and reference the product code: 216402P1"
        }
      ],
      "itinerary": [],
      "reviews": [
        {
          "name": "Theresa P",
          "text": "We had a fantastic time during this trek in off-season. We wanted to make sure to pick a Nepali company, all the admin was arranged making it super easy for us and our guide Pasang and porter Gombu were perfect calm company and supported us with absolutely everything the whole way, perhaps it’s possible to ask for their services when you book. Big recommendation and we’ll come again! "
        },
        {
          "name": "BENZAID S",
          "text": "Had an amazing time trekking to EBC with Ace The Himalaya. Both our guide Pasang and porter Gombu made this trek unforgettable and were very caring during the 14 days !!We decided to go off season to avoid too much crowd and although not sunny at all times, much recommended!Overall, very very good experience "
        },
        {
          "name": "heyrk1502",
          "text": "When I decided to embark my journey for Everest Base Camp, the so called EBC Trek, I wanted to make sure about the quality of organisers and did extensive research to figure out so many positive reviews about ACE the Himalayas. It was a group trek which taught me how to be the part of group which had 2 Americans, 2 Britishers, 2 Iranians, 2 Canadians , 2 Romanians and 2 IndiansFor someone who always believes it’s all about mindset and I could complete it without any preparation, I would surely call it moderate to difficult trek both mentally and physically, considering the 5K+ altitudeFrom landing on worlds most dangerous airport Lukla 🛫to Phakding to have fooseball game ⚽️with beers 🍻to Namche Bazar along with Everest view Hotel Trek 🏞️to Tighboce where we had our first sight of mightly Mt Everest 🏔️and Lohtseto Dingboche to have some awesome coffee ☕️ to hike to Nangkartshang Peakto Labuche to feel the atmosphere with super thin air and able to survive the same 🥶❄️to Gorak Shep to drop our bags to reach EBC and witness the world mightiest Mountain EVEREST also from Kala Patthar 🥾All of this makes EBC trek one of best and most memorable adventures of my lifeCheers to all fellow hikers for reaching new heights both on mountains and in our personal lives. See you soon matesPS: Thanks to our Guide Raj and Assistant Guide Dilip who were patient enough to tell names of all the peaks again and again and made this trek possible 🙂Raj had great knowledge about medication, equipment and weather. When a few members of our trip fell sick his team took care of them to the highest. He and his team always ensure our safety and comfort. I never felt it was rushed at any moment as you can imagine during any organised tripDilip has all the qualities of becoming a trek leader soon and all the very best brotherPS: Special thanks to all our sherpas who made it possible by carrying our duffle bags so that we could sleep comfortably during the entire trek 🫡When you plan such a lifetime experience, you definitely need a team like Ace, I wish ACE team a big Thank You as because of your guys 12 people have been able to ACE the Himalayas EBC Trek :)"
        },
        {
          "name": "Shenai B",
          "text": "A GREAT EXPERIENCE our guide Aamod Nepal and Poter kumar were wonderful, kind and patient with us. We had a good experience Amod went at our pace which was great. We were taken great care off from our arrive until our departure excellent service and care. All questions were answered to the best of their ability.Thank you guys."
        },
        {
          "name": "Shreya S",
          "text": "I recently had the opportunity to embark on a mesmerizing 14-day trek to Everest Base Camp with the exceptional team at Ace the Himalaya. Our guide, Pasang, was an absolute gem, sharing captivating stories and ensuring our safety. Special shoutout to the porters Gopal, Hem and Ihakpa who amazed us with their strength and kindness. The organization was flawless, with comfortable accommodations and delicious meals. This trek was truly remarkable, exceeding all expectations. I highly recommend Ace the Himalaya for an unforgettable Himalayan adventure."
        }
      ],
      "rate": "5.0694 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d13166235-Everest_Base_Camp_Trek_14_Days-Kathmandu_Kathmandu_Valley_Bagmati_Zone_Central_Reg.html",
      "categoryId": "6463c2109ae7fcd265eb30cd"
    },
    {
      "pid": "AttractionProductReview-g293890-d12577594-Bhaktapur_and_Nagarkot_Day_Tour_From_Kathmandu-Kathmandu_Kathmandu_Valley_Bagmati_",
      "name": "Bhaktapur and Nagarkot Day Tour From Kathmandu",
      "price": "from $60.00 per adult (price varies by group size)",
      "location": "Bhaktapur, Nagarkot, Kathmandu",
      "about": "Amazing historical tour of Bhaktapur.  Dipesh was very knowledgeable of the history and gave us an in depth tour of Bhaktapur with explanations of all the temples.  Weather wasn’t good but we still made an effort to see the view from Nagarkot.  Drive was something else!  Highly recommend this tour.Thank you, Kimberly! We're delighted to hear that you had an amazing historical tour of Bhaktapur with Dipesh. Our team takes pride in providing knowledgeable guides who can make your experience informative and enjoyable. Despite the weather, we're glad you made an effort to see the view from Nagarkot and had a memorable drive. Your recommendation means a lot to us, and we hope to welcome you back for more incredible tours in the future!Our guide Dipesh was Excellent.  Very informative and told us all about the History.  He was Very good.  Driver also was good.David, thank you for sharing your experience with us! We are thrilled to hear that Dipesh, our guide for the Bhaktapur and Nagarkot Tour, exceeded your expectations. His informative and engaging explanations about the history truly made the tour special. Our team takes pride in providing knowledgeable guides who can enrich your journey.\n\nWe're also glad that our driver contributed to your positive experience. Safety and comfort are always a priority for us, and we're pleased to know that our driver's service met your expectations.\n\nYour feedback is invaluable to us, and we hope to have the pleasure of hosting you on more memorable tours in the future! Until then, safe travels and best wishes from all of us.This tour gives you stunning views and plenty of history! My guide Dipesh was extremely knowledgeable about Nepal’s history and the relevance of each major site we visited. On this tour, you’re bound to find something you truly enjoy!Thank you, Amy! We're thrilled to hear that you had an amazing tour of Bhaktapur and Nagarkot with Dipesh as your guide. His extensive knowledge of Nepal's history and the major sites truly enhances the experience. We're glad you enjoyed the stunning views and the rich history during the tour. Your feedback is greatly appreciated, and we hope to welcome you back for more enjoyable adventures in the future!Our guide Dipak was excellent and very knowledgeable and our driver was absolutely brilliant. The transportation was excellent and the local food was very tasty. Bhaktapur Durbar Square- a place everyone must visit during their stay in Kathmandu …. highly recommend!Thank you, Sangi! We're thrilled to hear that you had an excellent experience on the Bhaktapur and Nagarkot Day tour with Dipak as your guide. Our team takes pride in providing knowledgeable and friendly guides to make your visit memorable. We're also glad to know that you enjoyed the transportation and the tasty local food. Bhaktapur Durbar Square is indeed a must-visit place, and we highly recommend it too! Your feedback means a lot to us, and we hope to welcome you back for more wonderful experiences in the future! Amazing trip to Nagarkot and Bhaktapur with Dipesh as our guide. He was so knowledgeable, helpful, and very patient with all our questions. Even provided us with water on this hot July day and a great rooftop restaurant recommendation! Our driver was also excellent at navigating the hills on the way to Nagarkot. It was a great day! Thank you!Thank you, JMcB! We're thrilled to hear that you had a great day tour to Nagarkot and Bhaktapur with Dipesh as your guide. Providing excellent service and ensuring your comfort are our top priorities. We're glad that Dipesh's knowledge and helpfulness made the trip amazing for your family. It's great to know that our driver's skills were appreciated as well. We hope to welcome you back for more wonderful experiences in the future! Highly recommended for culture and history buffs who love typical architecture and temples. Guide Subash (very knowledgeable)  and driver Ram made a nice  trip for me!!Really appreciated the historical insights and illustrative descriptions of our guide. Even though it was overcast in Nagorkot, the trip to Bhaktapur more than made up for it. Would definitely recommend this to any travelers who want to do a quick one-day tour of this historical site!The tour is two parts- first you drive up the mountain to a mountain-top lookout where on a clear day you can see Mt. Everest, unfortunately between smog and clouds we were not able to see much of anything when we reached the top but the drive up was amazing.  The second part of the tour has your guide take you through Bhaktapur and tell you about the various temples and sites within the square.  I would have loved to have heard more about the mountain way of life, but I think our group was too talkative amongst ourselves that we lost some of the time with the guide.  The van was spacious compared to normal Nepalese cabs and the driver was a pro at handling Nepalese traffic.I had a remarkable tour guide who provided a walking history narration of these two UNESCO sites. I learned a lot, asked a lot of questions, and I was also introduced to Nepalese yogurt (you haven’t had anything better, trust me). Madan was my guide and I can not recommend him enough. I’ve used guides in several venues and I think he is the best I’ve worked with. You will have a marvelous time in the hands of a easy-going, knowledgeable professional!Madan was my guide for the day tour.  He took me to Nagarkot where he explained the life of the people living in the mountains.  He also introduced the history and culture of Nepal in an interesting way.  I even had the chance to taste the wild berries on the hill side.  In Bhaktapur, Madan showed me the various temples and told me the interesting history and stories of all the places we visited.  I even tried the local yogurt which was very tasty.  Overall I had a few hours of enjoyable time with Madan who is a professional and knowledgeable guide.",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/87/68/a5.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/8c/f8/32.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/8c/f8/3d.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 3-99"
        },
        {
          "svg": "",
          "name": "Duration: 5–6 hours"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "Hotel pickup and drop-off by a private vehicle.Professional English speaking tour guide.Private transportation with air conditionMineral water during the tour.All TaxesMonuments entrance permit and fees (Total 1800 Rupees per person)Personal Expenses, Any meals and drinks.Gratuities for guide and driver.Entry/Admission - Bhaktapur Durbar SquareEntry/Admission - 55 Window Palace"
        },

        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.We will pick up from your hotel inside Kathmandu City (Ringroad).Hotel pickup is offered. View the hotel list on our checkout page to see if yours is included among the pickup points.Returns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleStroller accessibleNear public transportationInfants must sit on laps"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingFrom Nagarkot, mountain views are only visible when the weather is clear and without clouds.For Sunrise 4:30AM is best and For Sunset 1:00PM is best.Most travelers can participateThis experience requires good weather. If it’s canceled due to poor weather, you’ll be offered a different date or a full refundThis is a private tour/activity. Only your group will participate"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "FAQ",
          "text": "55 Window PalaceBhaktapur Durbar SquareNyatapola TempleDattatreya TemplePottery Square"
        },
        {
          "title": "Help",
          "text": "If you have questions about this tour or need help making your booking, we’d be happy to help. Just call the number below and reference the product code: 216402P1"
        }
      ],
      "itinerary": [
        {
          "title": "Pass by",
          "text": "Stop: 2 hours - Admission excluded"
        },
        {
          "title": "Bhaktapur Durbar Square",
          "text": "Stop: 30 minutes - Admission excluded"
        },
        {
          "title": "55 Window Palace",
          "text": "Stop: 30 minutes  "
        },
        {
          "title": "Nyatapola Temple",
          "text": "Stop: 30 minutes  "
        },
        {
          "title": "Pottery Square",
          "text": "Stop: 30 minutes  "
        },
        {
          "title": "Dattatreya Temple",
          "text": "Stop: 60 minutes  "
        },
        {
          "title": "Nagarkot",
          "text": "Stop: 30 minutes  "
        },
        {
          "title": "Nagarkot View Tower",
          "text": ""
        },
        {
          "title": "You'll return to the starting point",
          "text": ""
        }
      ],
      "reviews": [
        {
          "name": "Kimberly K",
          "text": "Amazing historical tour of Bhaktapur.  Dipesh was very knowledgeable of the history and gave us an in depth tour of Bhaktapur with explanations of all the temples.  Weather wasn’t good but we still made an effort to see the view from Nagarkot.  Drive was something else!  Highly recommend this tour.Thank you, Kimberly! We're delighted to hear that you had an amazing historical tour of Bhaktapur with Dipesh. Our team takes pride in providing knowledgeable guides who can make your experience informative and enjoyable. Despite the weather, we're glad you made an effort to see the view from Nagarkot and had a memorable drive. Your recommendation means a lot to us, and we hope to welcome you back for more incredible tours in the future!"
        },
        {
          "name": "David K",
          "text": "Our guide Dipesh was Excellent.  Very informative and told us all about the History.  He was Very good.  Driver also was good.David, thank you for sharing your experience with us! We are thrilled to hear that Dipesh, our guide for the Bhaktapur and Nagarkot Tour, exceeded your expectations. His informative and engaging explanations about the history truly made the tour special. Our team takes pride in providing knowledgeable guides who can enrich your journey.\n\nWe're also glad that our driver contributed to your positive experience. Safety and comfort are always a priority for us, and we're pleased to know that our driver's service met your expectations.\n\nYour feedback is invaluable to us, and we hope to have the pleasure of hosting you on more memorable tours in the future! Until then, safe travels and best wishes from all of us."
        },
        {
          "name": "Amy J",
          "text": "This tour gives you stunning views and plenty of history! My guide Dipesh was extremely knowledgeable about Nepal’s history and the relevance of each major site we visited. On this tour, you’re bound to find something you truly enjoy!Thank you, Amy! We're thrilled to hear that you had an amazing tour of Bhaktapur and Nagarkot with Dipesh as your guide. His extensive knowledge of Nepal's history and the major sites truly enhances the experience. We're glad you enjoyed the stunning views and the rich history during the tour. Your feedback is greatly appreciated, and we hope to welcome you back for more enjoyable adventures in the future!"
        },
        {
          "name": "Sangi",
          "text": "Our guide Dipak was excellent and very knowledgeable and our driver was absolutely brilliant. The transportation was excellent and the local food was very tasty. Bhaktapur Durbar Square- a place everyone must visit during their stay in Kathmandu …. highly recommend!Thank you, Sangi! We're thrilled to hear that you had an excellent experience on the Bhaktapur and Nagarkot Day tour with Dipak as your guide. Our team takes pride in providing knowledgeable and friendly guides to make your visit memorable. We're also glad to know that you enjoyed the transportation and the tasty local food. Bhaktapur Durbar Square is indeed a must-visit place, and we highly recommend it too! Your feedback means a lot to us, and we hope to welcome you back for more wonderful experiences in the future! "
        },
        {
          "name": "JMcB",
          "text": "Amazing trip to Nagarkot and Bhaktapur with Dipesh as our guide. He was so knowledgeable, helpful, and very patient with all our questions. Even provided us with water on this hot July day and a great rooftop restaurant recommendation! Our driver was also excellent at navigating the hills on the way to Nagarkot. It was a great day! Thank you!Thank you, JMcB! We're thrilled to hear that you had a great day tour to Nagarkot and Bhaktapur with Dipesh as your guide. Providing excellent service and ensuring your comfort are our top priorities. We're glad that Dipesh's knowledge and helpfulness made the trip amazing for your family. It's great to know that our driver's skills were appreciated as well. We hope to welcome you back for more wonderful experiences in the future! "
        }
      ],
      "rate": "5.059 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d12577594-Bhaktapur_and_Nagarkot_Day_Tour_From_Kathmandu-Kathmandu_Kathmandu_Valley_Bagmati_.html",
      "categoryId": "6463c2109ae7fcd265eb30ce"
    },
    {
      "pid": "AttractionProductReview-g293890-d13774467-UNESCO_Seven_World_Heritage_Tour_in_Kathmandu-Kathmandu_Kathmandu_Valley_Bagmati_Z",
      "name": "UNESCO Seven World Heritage Tour in Kathmandu",
      "price": "from $180.00 per adult (price varies by group size)",
      "location": "Kathmandu",
      "about": "Loved the tour! We spent the day making our way across the city visiting the many temples and districts of Kathmandu... (The monkey temple was the favorite!) We arrived just in time to see the Royal Kumari. (Which many people missed out on!) We had a nice lunch at a temple cafe, and had some tasty homemade candy as wandered through some really interesting areas! The guide, Shanti, was VERY knowledgeable and managed to navigate us through the crowds and to rain with ease! Thank you for the spectacular tour!Hi,\n\nThank you very much for taking service with us and glad to know our guide Shanti able to offer you good service and information about the trip. we are extremely looking forward to see you again in the future. Namaste!I was very pleased to be accompanied by Shanti, amazing tour guide and very knowledgeable lady, as she has her degree in Nepal history! Any question I had she was able to explain. The program is very full and active, so you need to rest well before going, please mind that! We visited  many squares and temples around Kathmandu, but I enjoyed  Bakhtapur the most (not only because we had lunch there)) - it is more of a peaceful place. One of the tour highlights was that we were able to see royal Kumari in her house, quite a rare event. Another one was visiting Pashupatinath Temple in Kathmandu, where we could witness Hindu cremation ritual, sight not for the light heart. I would certainly advise you going for this amazing day tour)Hi Ksenia,\n\nThank you very much for taking service with us and glad to know our guide Shanti were able to offer you good service and information during the tour. We love to offer you multi-days tour in future and feel free to come back for amazing cultural experience in Nepal. Have a nice nice and Namaste!If you want to see everything Kathmandu has to offer in one day, this is the tour for you!  Rabina was our guide and she did a great job! We were able to see everything we wanted to see plus more! They were very accommodating to our schedule and were willing to meet us a little bit later due to a cancellation with a previous appointment that day. Thank yo so much for making our trip memorable in Nepal!Hi Chris,\n\nThank you very much for for booking a trip with us and glad to know you loved this trip with Rabina. We are extremely looking forward to serve you again in the future and thank you once again for sharing your experience here. Namaste!I was only able to spend 5 days in Nepal and I wanted to visit all UNESCO world heritage sites. The tour was excellent and we were able to cover all sites in about 10 hours (might be longer in a bigger group, I traveled alone). My tour guide, Rabina, was very friendly and helpful answering all my questions regarding the history of the sites and Nepal culture in general. I really appreciated that I was able to take my time when I wanted to spend more time at one site, and did not feel pressured by the itinerary schedule. Hi Adrian,\n\nThank you very much for booking a trip with us and enjoying this trip with our guide Rabina. Glad to know you loved this trip. We hope to see you again for longer holidays in Nepal and feel free to contact us again. Namaste!Great experience. It was a 6h long visit with great details on the history of the places. Would definitely recommend if you like learning about monuments!Hi,\n\nThank you very much for booking a trip with us and glad to know you loved this trip with us. We hope to see you again for longer holidays in Nepal and feel free to contact us again. Namaste!Amazing! We spent a wonderful day with Rabina touring the UNESCO sites! This is a must do in Kathmandu and Rabina was excellent. She answered all of my questions with patience and is such a wealth of knowledge for culture, history and religion. This tour is a must do in Kathmandu. Clean car, safe driver, great English speaking tour guide. Highly recommend, 5 stars! Hi,\n\nThank you very much for booking a trip with us and glad to know you loved this trip with our guide Rabina. We hope to see you again for longer holidays in Nepal and feel free to contact us again. Namaste!I had a great day with Shanti. She is an expert in both Nepal history and culture, and really experienced giving tours, knowing the best ways/times to negotiate the sights and the best places for views/pictures. We even saw the Kumari! Thanks so much, Shanti!Hi Jessica,\n\nThank you very much for booking a trip with us and glad to know you loved this trip with our guide Shanti. We hope to see you again in the future for longer holidays in Nepal and feel free to contact again. Namaste!Had a fantastic day trip, informative, friendly guide, excellent english. Driver and car great. Highly recommendThank you very much for sharing a wonderful experience about our team and service. Looking forward to your further recommendation and love to see you again in Nepal for longer holiday. Namaste!Shanti Karki was an amazing guide!  Shanti is a history major and when I told her I am a geek for knowledge about the places I travel she gave me all the educational information and history and insight into Buddhist and Hindu cultures that I was for once totally satiated!She totally catered the tour to what I wanted to do and even gave me time to have butter tea and chat with the monks at the monkey temple!   Shanti was kind and considerate and really good at helping me get the most out of my experience - and not get my glasses stolen by mischievous monkeys :-) I highly recommend this tour and especially Shanti Karki!And a HUGE shout out to our driver Narayan Shrestha! He navigated the streets of Kathmandu and the surrounding area like a pro and I never once felt nervous with him at the helm!Thanks to both of them I had a wonderful day!!Hi Amber,\n\nThank you very much for sharing a wonderful experience about our team and service. Looking forward to your further recommendation and love to see you again in Nepal for longer holiday. Namaste!I had a wonderful tour with Shanti visiting the seven world heritage sites around the Kathmandu valley. Shanti was full of information and was always checking in with me to make sure things were going well. This tour is a definite must do.Hi Dan,\n\nIt is our pleasure to serve you in this cultural & heritage Planet of the Kathmandu Valley. Thank you for trusting us as your local operator here and glad to know our guide Shanti able to offer you good service and sharing depth knowledge of the all sites of Kathmandu. We are extremely looking forward to your recommendation who love to visit Kathmandu. Namaste!",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/07/2c/17/9d.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/07/2c/17/bd.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/07/2b/6c/87.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 11-65"
        },
        {
          "svg": "",
          "name": "Duration: 12h"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "Private vehicleEnglish Speaking GuideAll required entry fee in 7 Heritage sites.Hotel pick up and drop off.Entry/Admission - Swayambhunath TempleEntry/Admission - Amideva Buddha ParkEntry/Admission - Kumari ChowkEntry/Admission - Durbar (Central) SquareEntry/Admission - Golden Temple (Hiranya Varna Mahavihar)Entry/Admission - Patan MuseumEntry/Admission - Nyatapola TempleEntry/Admission - Dattatreya TempleEntry/Admission - 55 Window PalaceEntry/Admission - Siddha PokhariEntry/Admission - Changu NarayanEntry/Admission - Pashupatinath TempleEntry/Admission - Boudhanath StupaLunch in Bhaktapur (your choice of many great eateries are available)Tips & Gratuities"
        },

        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.We pick up our all travelers from their hotel inside Ring road including Bouddha area. Please do provide your hotel name for pick up location.Hotel pickup is offered. View the hotel list on our checkout page to see if yours is included among the pickup points.Returns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleStroller accessibleNear public transportation"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingDress code is smart casualNot recommended for pregnant travelersNo heart problems or other serious medical conditionsMost travelers can participateThis is a private tour/activity. Only your group will participate"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "FAQ",
          "text": "Changu NarayanKumari ChowkPashupatinath TemplePatan MuseumDurbar (Central) Square"
        },
        {
          "title": "Help",
          "text": "If you have questions about this tour or need help making your booking, we’d be happy to help. Just call the number below and reference the product code: 216402P1"
        }
      ],
      "itinerary": [
        {
          "title": "Pass by",
          "text": "Stop: 15 minutes - Admission included"
        },
        {
          "title": "Swayambhunath Temple",
          "text": "Stop: 10 minutes - Admission included"
        },
        {
          "title": "Amideva Buddha ParkPass by",
          "text": "Stop: 10 minutes - Admission included"
        },
        {
          "title": "Kumari ChowkPass by",
          "text": "Stop: 25 minutes - Admission included"
        },
        {
          "title": "Durbar (Central) Square",
          "text": "Stop: 10 minutes - Admission included"
        },
        {
          "title": "Golden Temple (Hiranya Varna Mahavihar)",
          "text": "Stop: 15 minutes - Admission included"
        },
        {
          "title": "Patan MuseumPass by",
          "text": "Stop: 10 minutes - Admission included"
        },
        {
          "title": "Nyatapola Temple",
          "text": "Stop: 10 minutes - Admission included"
        },
        {
          "title": "Dattatreya Temple",
          "text": "Stop: 10 minutes - Admission included"
        },
        {
          "title": "55 Window Palace",
          "text": "Stop: 5 minutes - Admission included"
        },
        {
          "title": "Siddha Pokhari",
          "text": ""
        }
      ],
      "reviews": [
        {
          "name": "Lane",
          "text": "Loved the tour! We spent the day making our way across the city visiting the many temples and districts of Kathmandu... (The monkey temple was the favorite!) We arrived just in time to see the Royal Kumari. (Which many people missed out on!) We had a nice lunch at a temple cafe, and had some tasty homemade candy as wandered through some really interesting areas! The guide, Shanti, was VERY knowledgeable and managed to navigate us through the crowds and to rain with ease! Thank you for the spectacular tour!Hi,\n\nThank you very much for taking service with us and glad to know our guide Shanti able to offer you good service and information about the trip. we are extremely looking forward to see you again in the future. Namaste!"
        },
        {
          "name": "Ksenia A",
          "text": "I was very pleased to be accompanied by Shanti, amazing tour guide and very knowledgeable lady, as she has her degree in Nepal history! Any question I had she was able to explain. The program is very full and active, so you need to rest well before going, please mind that! We visited  many squares and temples around Kathmandu, but I enjoyed  Bakhtapur the most (not only because we had lunch there)) - it is more of a peaceful place. One of the tour highlights was that we were able to see royal Kumari in her house, quite a rare event. Another one was visiting Pashupatinath Temple in Kathmandu, where we could witness Hindu cremation ritual, sight not for the light heart. I would certainly advise you going for this amazing day tour)Hi Ksenia,\n\nThank you very much for taking service with us and glad to know our guide Shanti were able to offer you good service and information during the tour. We love to offer you multi-days tour in future and feel free to come back for amazing cultural experience in Nepal. Have a nice nice and Namaste!"
        },
        {
          "name": "Chris H",
          "text": "If you want to see everything Kathmandu has to offer in one day, this is the tour for you!  Rabina was our guide and she did a great job! We were able to see everything we wanted to see plus more! They were very accommodating to our schedule and were willing to meet us a little bit later due to a cancellation with a previous appointment that day. Thank yo so much for making our trip memorable in Nepal!Hi Chris,\n\nThank you very much for for booking a trip with us and glad to know you loved this trip with Rabina. We are extremely looking forward to serve you again in the future and thank you once again for sharing your experience here. Namaste!"
        },
        {
          "name": "Adrian S",
          "text": "I was only able to spend 5 days in Nepal and I wanted to visit all UNESCO world heritage sites. The tour was excellent and we were able to cover all sites in about 10 hours (might be longer in a bigger group, I traveled alone). My tour guide, Rabina, was very friendly and helpful answering all my questions regarding the history of the sites and Nepal culture in general. I really appreciated that I was able to take my time when I wanted to spend more time at one site, and did not feel pressured by the itinerary schedule. Hi Adrian,\n\nThank you very much for booking a trip with us and enjoying this trip with our guide Rabina. Glad to know you loved this trip. We hope to see you again for longer holidays in Nepal and feel free to contact us again. Namaste!"
        },
        {
          "name": "Andrés P",
          "text": "Great experience. It was a 6h long visit with great details on the history of the places. Would definitely recommend if you like learning about monuments!Hi,\n\nThank you very much for booking a trip with us and glad to know you loved this trip with us. We hope to see you again for longer holidays in Nepal and feel free to contact us again. Namaste!"
        }
      ],
      "rate": "5.089 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d13774467-UNESCO_Seven_World_Heritage_Tour_in_Kathmandu-Kathmandu_Kathmandu_Valley_Bagmati_Z.html",
      "categoryId": "6463c2109ae7fcd265eb30ce"
    },
    {
      "pid": "AttractionProductReview-g293890-d20187061-Nagarkot_Sunrise_and_Bhaktapur_Durbar_Squar_UNESCO_Tour-Kathmandu_Kathmandu_Valley",
      "name": "Nagarkot Sunrise and Bhaktapur Durbar Squar UNESCO Tour",
      "price": "from $75.00 per adult (price varies by group size)",
      "location": "Nagarkot, Bhaktapur",
      "about": "We had an amazing time in this tour. We were able to see a different side of Nepal, watching the city at night on our way to Nagarkot to see the sunrise. The driver was fast but safe, and the guide was incredibly knowledgeable about everything in Bhaktapur Durbar Square. He took us to an amazing cafe where we were able to look over two amazing temples. Highly Recommend for an amazing morning in the Kathmandu Valley. Also he took great photos of us.Thank you very much for your precious time with us for Nagarkot Sunrise and Bhaktapur Durbar Squar UNESCO Tour. We hope you enjoyed from tour and you will give us chance to serve your next trip to Nepal soon. Also we aspect lost of recommendation to your friends with us for any kind of trip to Nepal, Bhutan and Tibet Tour. Namaste !Amazing view over Himalayas Mountain Range on early morning sunrise scenery, this is a once in a lifetime experience, highly recommended if you have time when visiting Kathmandu.Thank you so much for your great time with us and your great recommendation review on our behalf. I hope we will get another chance to serve your next trip to Nepal soon. Namaste.We went on the half day Nagarkot and Bhaktapur Durbar square tour with Mr. Prakash. We started early at 4AM from the hotel (the tour included pick up) and rode to Nagarkot which took about 1 hour. Our tour guide, Mr. Prakash provided informational commentary on the key areas along the way. After we reached Nagarkot viewpoint, we saw the sun rise from above the clouds - it was very beautiful. The visibility was not great so we couldn’t get a good view of the mountain range, it was beautiful nevertheless. After which, Mr. Prakash took us to breakfast which was amazing - a full continental spread and some Indian food overlooking the mountains with outdoor seating. Then we took the drive to Bhaktapur Durbar square, a place filled with history, temples and culture. Mr. Prakash was so knowledgeable and kind to us in explaining each detail carefully while answering all our questions from our naturally curious group. He was patient while we took pictures and made us feel comfortable throughout the trip. We explored the local shopping areas, while being insulated by Mr. Prakash from the onslaught of vendors and pointed us to key specialties from the area. One such being thanka paintings on cotton canvas - the school/shop personell gave us a detailed walkthrough and my mom and I ended up getting a few paintings to help the school. Overall, this was memorable tour for us and felt taken care through the entire tour. Thanks to Mr. Prakash and crew at attractive travels. We were so satisfied, We ended up taking multiple tours with the same team. Highly recommend! Thank you so much for your valuable time with us for 2 days tour in Kathmandu Rajkumar Sir, Papa and Mama. I hope you enjoyed from tour. Great thanks for your great recommendation review on our behalf. I hope you will offer another chance to serve your next trip to Nepal soon. Namaste.Excellent trip with a wonderful knowledgeable and kind guide who looked after us every step of the way. Mt Everest at dawn is truly a spectacular sight and the tour of Bhaktapur was so varied and interesting. Highly recommended!!Thank you so much for your time with us for Nagarkot Sunrise and Bhaktapur Durbar Squar UNESCO World Heritage Sites Tour. Great thanks for your time to write us great recommendation review on our behalf. I hope we will get chance to serve your next trip to Nepal soon. Namaste !Our guide Prakash was gentle and knowledgeable as he led us on this tour.  As were rode up the the viewing area he shared about the area of Katmandu and also shared about his personal life.  As we came across places of interest that were not mentioned in the tour description we were able to make extra stops of personal interest.  As a teacher it was special to see a school in Nepal. Prakash and our driver Som were very accommodating.  Thank you to you both!Thank you so much for your precious words recommendation review on our behalf. We are happy to get chance to serve your trip to Nepal. Yes Prakash was happy to assist you as tour guide. Hope we will get chance to serve your next trip to Nepal soon. Namaste.Best tour agency in Kathmandu. Highly recommend to all. Mr. Prakash is top tour guide in Kathmandu. So no need to contact others except Attractive TravelsThank you so much  for your valuable time with us and your precious words on our behalf. I hope you will give us chance to serve your next trip to Nepal. Namaste.Sunrise over Himalaya experience and temple tour.  Beautiful experience with a knowledgeable and fun guide.  Good communication.Thank you so much Kip for your valuable time with us and your precious words on our behalf. I hope you will give us chance to serve your next trip to Nepal. Namaste.I did Nagarkot sunrise and Bhaktapur Durbar Squar UNESCO Tour. Nagarkot is best place to see sunrise and himalayas. Mr. Prakash is best tour guide.Highly recommend this agency for Nepal trip.Thank you so much for your valuable time with us and precious words on our behalf.This was a great tour! Prakash was my tour guide, and he provided tons of interesting information and history throughout the tour. I was traveling alone and felt safe with Prakash and the driver the whole time. The sunrise at Nagarkot was beautiful, and I really enjoyed walking around Bhaktapur. Some highlights for me were pottery square and the Lama Thanka Painting School. Highly recommend!Thank you so much for your precious words on our behalf Shannon. We hope you enjoyed from trip. Hope you will give us chance again to serve your next trip to Nepal . Namaste 🙏 Amazing time on this tour! Tour guide was very nice and gave so much information. The driver was great and i felt safe all the time.Thank you so much for your precious words on our behalf.  I hope you will give us chance to serve your next trip to Nepal soon. Namaste 🙏 ",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/10/3d/c1/60.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/10/3d/c1/68.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/10/3f/63/fa.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 1-99"
        },
        {
          "svg": "",
          "name": "Duration: 5–7 hours"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "All the transportation as per the itinerary.A professional tour guide.An assistant guide for more than 15 pax.Visit Thanka Panting School in Bhaktapur. Foods.Entry fee in Bhaktapur Durbar Squar UNESCO Site.Tips for your guide and driver.Entry/Admission - Bhaktapur Durbar SquareEntry/Admission - Dattatreya TempleEntry/Admission - Nyatapola Temple"
        },

        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.The travelers are picked up from hotel or Tribhuvan Airport, Kathmandu Nepal. According with their comfortable place.Airports:Tribhuvan Airport, Kathmandu NepalHotel pickup is offered. View the hotel list on our checkout page to see if yours is included among the pickup points.Returns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleInfants must sit on laps"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingNo heart problems or other serious medical conditionsMost travelers can participateThis is a private tour/activity. Only your group will participate"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "FAQ",
          "text": "Bhaktapur Durbar SquareNyatapola TempleDattatreya TemplePottery SquareNagarkot View Tower"
        },
        {
          "title": "Help",
          "text": "If you have questions about this tour or need help making your booking, we’d be happy to help. Just call the number below and reference the product code: 216402P1"
        }
      ],
      "itinerary": [
        {
          "title": "Nagarkot View Tower",
          "text": "Stop: 2 hours - Admission excluded"
        },
        {
          "title": "Bhaktapur Durbar Square",
          "text": "Stop: 20 minutes - Admission excluded"
        },
        {
          "title": "Dattatreya Temple",
          "text": "Stop: 20 minutes - Admission excluded"
        },
        {
          "title": "Nyatapola Temple",
          "text": "Stop: 20 minutes  "
        },
        {
          "title": "Pottery Square",
          "text": "Stop: 30 minutes  "
        },
        {
          "title": "Nagarkot Buddha Peace Park Hiking Trail",
          "text": ""
        },
        {
          "title": "You'll return to the starting point",
          "text": ""
        }
      ],
      "reviews": [
        {
          "name": "Donovan",
          "text": "We had an amazing time in this tour. We were able to see a different side of Nepal, watching the city at night on our way to Nagarkot to see the sunrise. The driver was fast but safe, and the guide was incredibly knowledgeable about everything in Bhaktapur Durbar Square. He took us to an amazing cafe where we were able to look over two amazing temples. Highly Recommend for an amazing morning in the Kathmandu Valley. Also he took great photos of us.Thank you very much for your precious time with us for Nagarkot Sunrise and Bhaktapur Durbar Squar UNESCO Tour. We hope you enjoyed from tour and you will give us chance to serve your next trip to Nepal soon. Also we aspect lost of recommendation to your friends with us for any kind of trip to Nepal, Bhutan and Tibet Tour. Namaste !"
        },
        {
          "name": "Jun F",
          "text": "Amazing view over Himalayas Mountain Range on early morning sunrise scenery, this is a once in a lifetime experience, highly recommended if you have time when visiting Kathmandu.Thank you so much for your great time with us and your great recommendation review on our behalf. I hope we will get another chance to serve your next trip to Nepal soon. Namaste."
        },
        {
          "name": "Rajkumar R",
          "text": "We went on the half day Nagarkot and Bhaktapur Durbar square tour with Mr. Prakash. We started early at 4AM from the hotel (the tour included pick up) and rode to Nagarkot which took about 1 hour. Our tour guide, Mr. Prakash provided informational commentary on the key areas along the way. After we reached Nagarkot viewpoint, we saw the sun rise from above the clouds - it was very beautiful. The visibility was not great so we couldn’t get a good view of the mountain range, it was beautiful nevertheless. After which, Mr. Prakash took us to breakfast which was amazing - a full continental spread and some Indian food overlooking the mountains with outdoor seating. Then we took the drive to Bhaktapur Durbar square, a place filled with history, temples and culture. Mr. Prakash was so knowledgeable and kind to us in explaining each detail carefully while answering all our questions from our naturally curious group. He was patient while we took pictures and made us feel comfortable throughout the trip. We explored the local shopping areas, while being insulated by Mr. Prakash from the onslaught of vendors and pointed us to key specialties from the area. One such being thanka paintings on cotton canvas - the school/shop personell gave us a detailed walkthrough and my mom and I ended up getting a few paintings to help the school. Overall, this was memorable tour for us and felt taken care through the entire tour. Thanks to Mr. Prakash and crew at attractive travels. We were so satisfied, We ended up taking multiple tours with the same team. Highly recommend! Thank you so much for your valuable time with us for 2 days tour in Kathmandu Rajkumar Sir, Papa and Mama. I hope you enjoyed from tour. Great thanks for your great recommendation review on our behalf. I hope you will offer another chance to serve your next trip to Nepal soon. Namaste."
        },
        {
          "name": "TravelOption",
          "text": "Excellent trip with a wonderful knowledgeable and kind guide who looked after us every step of the way. Mt Everest at dawn is truly a spectacular sight and the tour of Bhaktapur was so varied and interesting. Highly recommended!!Thank you so much for your time with us for Nagarkot Sunrise and Bhaktapur Durbar Squar UNESCO World Heritage Sites Tour. Great thanks for your time to write us great recommendation review on our behalf. I hope we will get chance to serve your next trip to Nepal soon. Namaste !"
        },
        {
          "name": "Tricia W",
          "text": "Our guide Prakash was gentle and knowledgeable as he led us on this tour.  As were rode up the the viewing area he shared about the area of Katmandu and also shared about his personal life.  As we came across places of interest that were not mentioned in the tour description we were able to make extra stops of personal interest.  As a teacher it was special to see a school in Nepal. Prakash and our driver Som were very accommodating.  Thank you to you both!Thank you so much for your precious words recommendation review on our behalf. We are happy to get chance to serve your trip to Nepal. Yes Prakash was happy to assist you as tour guide. Hope we will get chance to serve your next trip to Nepal soon. Namaste."
        }
      ],
      "rate": "5.030 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d20187061-Nagarkot_Sunrise_and_Bhaktapur_Durbar_Squar_UNESCO_Tour-Kathmandu_Kathmandu_Valley.html",
      "categoryId": "6463c2109ae7fcd265eb30ce"
    },
    {
      "pid": "AttractionProductReview-g293890-d24081739-3_Day_Chitwan_National_Park_Jungle_Safari_Tour_Package_with_Pick_Up-Kathmandu_Kath",
      "name": "3-Day Chitwan National Park Jungle Safari Tour Package with Pick Up",
      "price": "from $190.00 per adult",
      "location": "Chitwan",
      "about": "We loved this trip. Communication was perfect from the start until the end, we could ask anything. The accommodation was excellent, with very good service. The staff was very friendly, the room very comfortable and clean, the food delicious. They helped us with everything we needed. The activities were very interesting: we saw rhino’s, crocodiles and other wildlife. The jungle walk was very exciting and relaxing at the same time. The visit of the elephant breeding centre was lovely, they take very good care of them. We had a kind and well-informed English-speaking local guide who answered all our questions. We would recommend this trip to everyone!Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Well organized by travel company.enjoied alot . beautiful place nature Infront of us.thanks welcome Nepal trekks team for excellent arrangements.Highly recommend.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Very nice and well organized trip! I was on a good hotel named Safari Adventure Lodge, and it was very good. Friendly host and guides! Beautyfull nature and safari. I didnt see the tiger, but I saw many others animals.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Absolutely amazing experience! Everything was planned perfectly and as described. All staff were lovely and the safari experience was like no other. Highly recommend!Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.A great experience, would highly recommend. We were really well looked after by Nawa. Lots of moments I will never forget Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Nawa was an excellent guide along with mahindra for the nature trails, would highly recommend. Lovely place to visitDear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.We had an amazing experience in Chitwon. Every service was so nice. Thank you so much for helping to organise our trip to Chitwon National park wildlife Safari..🙏📍Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Very special mention again to Gopal the jungle tour guide. Professional, excellent English, highly knowledgeable on all flora and fauna in the park! I recommend you ask for him!!Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.We had a great trip, very well organised from start to finish, out tour guide was excellent and very informative.We had enough time to admire the nature and rest in between activities which was excellent in the heat.Can totally recommend 10/10!!!Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Five stars just isn't enough!! Me and my partner travelled from Kathmandu to Chitwan and couldn't fault anything about the weekend! The service was impeccable from the starting taxi ride to the final coach trip to Pokhara. The Hotel was immaculate and had Air con which was very refreshing. We ventures 4 safari types being elephant trek, jungle trek, jeep safari and boat safari. Unfortunately we couldn't see the tiger but the wildlife was amazing and was so peaceful. Special thanks to nawa and deepoo Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/0e/f3/c4/df.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/0e/f3/c5/12.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/0e/f3/c5/15.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 5-99, max of 25 per group"
        },
        {
          "svg": "",
          "name": "Duration: 3 days"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "German, English, Italian, French, Spanish"
        },
        {
          "svg": "",
          "name": "Features animals"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "LunchBreakfastBreakfastDinnerLunchDinnerKathmandu -Chitwan -Kathmandu transfers by Tourist bus National Park Fee Entry/Admission - Chitwan Tharu VillagePersonal expenses (Tips, beverage, laundry, telephone call, etc) "
        },
        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.Departure from Kathmandu. We pick up from your hotel. Departure Time: 6:00 AM Airports:Tribhuvan Airport, Kathmandu NepalHotel pickup is offered. View the hotel list on our checkout page to see if yours is included among the pickup points.Returns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleStroller accessibleService animals allowedNear public transportationInfant seats available"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingNo heart problems or other serious medical conditionsMost travelers can participateThis tour/activity will have a maximum of 25 travelers"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "FAQ",
          "text": "Chitwan Tharu Village"
        }
      ],
      "itinerary": [],
      "reviews": [
        {
          "name": "Annelies S",
          "text": "We loved this trip. Communication was perfect from the start until the end, we could ask anything. The accommodation was excellent, with very good service. The staff was very friendly, the room very comfortable and clean, the food delicious. They helped us with everything we needed. The activities were very interesting: we saw rhino’s, crocodiles and other wildlife. The jungle walk was very exciting and relaxing at the same time. The visit of the elephant breeding centre was lovely, they take very good care of them. We had a kind and well-informed English-speaking local guide who answered all our questions. We would recommend this trip to everyone!Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Aanjan R",
          "text": "Well organized by travel company.enjoied alot . beautiful place nature Infront of us.thanks welcome Nepal trekks team for excellent arrangements.Highly recommend.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Esben M",
          "text": "Very nice and well organized trip! I was on a good hotel named Safari Adventure Lodge, and it was very good. Friendly host and guides! Beautyfull nature and safari. I didnt see the tiger, but I saw many others animals.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Simon F",
          "text": "Absolutely amazing experience! Everything was planned perfectly and as described. All staff were lovely and the safari experience was like no other. Highly recommend!Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Mary Whyte",
          "text": "A great experience, would highly recommend. We were really well looked after by Nawa. Lots of moments I will never forget Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        }
      ],
      "rate": "5.070 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d24081739-3_Day_Chitwan_National_Park_Jungle_Safari_Tour_Package_with_Pick_Up-Kathmandu_Kath.html",
      "categoryId": "6463c2109ae7fcd265eb30d0"
    },
    {
      "pid": "AttractionProductReview-g293890-d12466057-Day_Trip_to_Bhaktapur_and_Panauti_from_Kathmandu-Kathmandu_Kathmandu_Valley_Bagmat",
      "name": "Day Trip to Bhaktapur and Panauti from Kathmandu",
      "price": "from $34.00 per adult",
      "location": "Bhaktapur, Panauti, Kathmandu",
      "about": "We really enjoyed our tour to Bhaktapur and Panauti. The drive was very comfortable and we enjoyed looking round Bhaktapur despite the rain. Our guide, Akshay, was very knowledgeable about the history of the area and knew lots of stories too. He taloured the tour to our interests, trying some Juju Dhau and pottery making!Lunch at our homestay was delicious and included trying our hand at some cooking!Thank you!Bhaktapur is definitely worth visiting. Our guide, Akshay made it even more interesting; he was very knowledgeable and fun to interact with. He organized lunch with a local family, it was very authentic  and a nice surprise; food was tasty and it felt good to support the local community. The day was nice and relaxed l, we never felt pressured for time and Akshay was ready to answer all our questions. We learned a lot about the area and the history of Nepal, we recommend this tour and our guide Akshay.I had a great experience with Jumo, and she brought me around with much insights to offer. She was very knowledgeable on the places and culture, and even shared some history of how the places evolved over the years. Loved this tour and will definitely recommend it to people looking for a short half day tour outside of Kathmandu.We had a wonderful day with our tour guide, Akshay and our driver who kept us safe in the chaotic traffic of Nepal. Akshay, was competent, knowledgeable, and made it a lot of fun with his humor.  The tour was well paced, visiting all the historical sites with time to browse and do a little shopping and snacking on delicious freshly made yogurt.  A special highlight was the homestay lunch in Panauti. I was the best Dal Bhat we had in all of Nepal! I highly recommend adding this tour to your visit.Dilip was an excellent tour guide. He could answer all our questions and had a deep knowledge about religion and culture.Great tour to explore the outskirt of the Kathmandu valley! Given the size of the grounds its worth it to have a tour guide. Ours, Dilip, was amazing!A wonderfully authentic experience of Bhaktapur and Panauti. Having a Dal Bhat lunch prepared and shared with us by a local Nepali family in Panauti was a highlight of our trip.Very well organised day trip from Kathmandu. Definitely worth checking out if you're in the area. Both places are heritage listed. Tour guide was great.It was one of the best tours I have ever done! I would highly recommend it. From the moment of departure to the end, everything is worth it. From the meeting point a van came to pick us up, super clean and air-conditioned. Our guide (the nicest person I have ever met!) started to tell us about the route we were going to do, and during the way (1 hour and a half to Panauti) she filled us with beautiful stories about her culture. During the rest of the tour, he answered all our questions, she went to the shops and showed us what they use everything for, and she gave us all the time in the world to stop and take pictures, I even enjoyed a pottery class, and tasted a typical yogurt dessert.Thanks for everything! Very nice! The guide and driver were very friendly. The places were beautiful and it was nice to hear the stories behind the places that we visited.",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/7b/24/d4.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/a6/59/14.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/a6/56/ea.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 0-90, max of 10 per group"
        },
        {
          "svg": "",
          "name": "Duration: 7h"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "English-speaking tour guideTransport by air conditioned vehicle as per group sizeHotel pickup and drop-offLunchAll Fees and TaxesEntry/Admission - Bhaktapur Durbar SquareEntry/Admission - Panauti"
        },
        {
          "title": "Departure and return",
          "text": "Royal Mountain Travel, Lal Durbar Marg, Kathmandu 44601, Nepal\nReturns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleNear public transportationInfant seats available"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingEntrance fee is applicable to children 10 years and abovePlease be informed that, entrance fee is not includedMost travelers can participateThis tour/activity will have a maximum of 10 travelers"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "FAQ",
          "text": "Bhaktapur Durbar Square"
        }
      ],
      "itinerary": [
        {
          "title": "Bhaktapur Durbar Square",
          "text": "Stop: 3 hours - Admission excluded"
        },
        {
          "title": "Panauti Community Home Stay",
          "text": ""
        },
        {
          "title": "You'll return to the starting point",
          "text": ""
        }
      ],
      "reviews": [
        {
          "name": "Rachel C",
          "text": "We really enjoyed our tour to Bhaktapur and Panauti. The drive was very comfortable and we enjoyed looking round Bhaktapur despite the rain. Our guide, Akshay, was very knowledgeable about the history of the area and knew lots of stories too. He taloured the tour to our interests, trying some Juju Dhau and pottery making!Lunch at our homestay was delicious and included trying our hand at some cooking!Thank you!"
        },
        {
          "name": "RDC1977",
          "text": "Bhaktapur is definitely worth visiting. Our guide, Akshay made it even more interesting; he was very knowledgeable and fun to interact with. He organized lunch with a local family, it was very authentic  and a nice surprise; food was tasty and it felt good to support the local community. The day was nice and relaxed l, we never felt pressured for time and Akshay was ready to answer all our questions. We learned a lot about the area and the history of Nepal, we recommend this tour and our guide Akshay."
        },
        {
          "name": "thetravelcow",
          "text": "I had a great experience with Jumo, and she brought me around with much insights to offer. She was very knowledgeable on the places and culture, and even shared some history of how the places evolved over the years. Loved this tour and will definitely recommend it to people looking for a short half day tour outside of Kathmandu."
        },
        {
          "name": "ELIZ_M1013",
          "text": "We had a wonderful day with our tour guide, Akshay and our driver who kept us safe in the chaotic traffic of Nepal. Akshay, was competent, knowledgeable, and made it a lot of fun with his humor.  The tour was well paced, visiting all the historical sites with time to browse and do a little shopping and snacking on delicious freshly made yogurt.  A special highlight was the homestay lunch in Panauti. I was the best Dal Bhat we had in all of Nepal! I highly recommend adding this tour to your visit."
        },
        {
          "name": "Sabrina",
          "text": "Dilip was an excellent tour guide. He could answer all our questions and had a deep knowledge about religion and culture."
        }
      ],
      "rate": "5.076 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d12466057-Day_Trip_to_Bhaktapur_and_Panauti_from_Kathmandu-Kathmandu_Kathmandu_Valley_Bagmat.html",
      "categoryId": "6463c2109ae7fcd265eb30d0"
    },
    {
      "pid": "AttractionProductReview-g293890-d19499705-1_Hour_Mount_Everest_flight_from_Kathmandu_With_Hotel_Pick_Up-Kathmandu_Kathmandu_",
      "name": "1 Hour Mount Everest flight from Kathmandu With Hotel Pick Up",
      "price": "from $250.00 per adult (price varies by group size)",
      "location": "Solukhumbu, Kathmandu",
      "about": "Pretty nice view of the Himalayas. Flight is with a local commercial airline and plane is fairly big. It gets pretty close to the mountains, but a helicopter flight would probably have felt more personal. Driver and guide were on time and very courteous. Travel agency was great to deal with.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Thank you very much for this wonderful experience. 1 hour Mount Everest sightseeing is best. To every one who want to see the Himalayan in easy way with best price with Mr Hari. The transportation, guides, food and other arrangements was quite good. Really gathered a nice experience when have tour in mountain Everest. Thank you Mr Hari.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.I just write to you to tell you that I am pleased to stay in your hotel. I enjoy Atmosfire, silence, food almost everything Specially I have to thank you for your  Room service staff they try to make clean my Room properly Well please behalf of I give my thanks to  Room service Mrs. Sunita Gurung  housekeeping supervisor and Miss Sabrina and Chef Dliiraj, wiater Pandcy also all the staff My compliment for having such a good staff. Next time I will come to Kathmandu i will come back to your hotelDear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Thank you very much for this nice experience. This 1 hour Mount Everest sightseeing is best. To every one who want to see the Himalayan in easy way with best price. They pick up from hotel and even drop to hotel by private transport it’s very easy trip.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Nice Himalayan view. Good airlines good driver Mr Deepak we really enjoy the trip of mountain flight. Thanks welcome Nepal treks team for trip. Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Quick contact easy booking and Wonderful experience nice view great service recommend trip to anyone. Thanks mr nawa for your great hospitality and help.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Amazing view of everest with other snow covered mountains. A flight with each one of us getting a window seat and clear view of the Himalayas and everest was breath taking. Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.It was a great experience, witnessing mount everest with naked eye. Very well planned by \"Welcome Nepal Treks\" and their team. Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Great friendly straightforward organisation, superb once in a lifetime experience. Highly recommended Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Excellent views and door to door service!  Driver was friendly and helpful.  Trip went without any problems. Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/be/f6/32.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/be/f6/48.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/be/f6/49.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 5-120, max of 15 per group"
        },
        {
          "svg": "",
          "name": "Duration: 53m"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "1 HRS Flight (full refundable in case of no flight)CertificateGuaranteed Window seatPick up from Kathmandu Hotel to Airport and drop off from airport to Hotel.Entry/Admission - Mount Everest"
        },

        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.Tribhuvan International Airport, Ring Rd, काठमाडौँ 44600, Nepal\nTribhuvan International AirportAirports:Tribhuvan Airport, Kathmandu NepalReturns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Infants must sit on lapsNear public transportationStroller accessibleWheelchair accessible"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingMost travelers can participateInfant seats unavailableNot suitable for petsWheelchair accessibleThis experience requires good weather. If it’s canceled due to poor weather, you’ll be offered a different date or a full refundThis tour/activity will have a maximum of 15 travelers"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },

        {
          "title": "Help",
          "text": "If you have questions about this tour or need help making your booking, we’d be happy to help. Just call the number below and reference the product code: 216402P1"
        }
      ],
      "itinerary": [
        {
          "title": "Mount Everest",
          "text": ""
        },
        {
          "title": "You'll return to the starting point",
          "text": ""
        }
      ],
      "reviews": [
        {
          "name": "Crystal C",
          "text": "Pretty nice view of the Himalayas. Flight is with a local commercial airline and plane is fairly big. It gets pretty close to the mountains, but a helicopter flight would probably have felt more personal. Driver and guide were on time and very courteous. Travel agency was great to deal with.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Yaminii A",
          "text": "Thank you very much for this wonderful experience. 1 hour Mount Everest sightseeing is best. To every one who want to see the Himalayan in easy way with best price with Mr Hari. The transportation, guides, food and other arrangements was quite good. Really gathered a nice experience when have tour in mountain Everest. Thank you Mr Hari.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Gamini J",
          "text": "I just write to you to tell you that I am pleased to stay in your hotel. I enjoy Atmosfire, silence, food almost everything Specially I have to thank you for your  Room service staff they try to make clean my Room properly Well please behalf of I give my thanks to  Room service Mrs. Sunita Gurung  housekeeping supervisor and Miss Sabrina and Chef Dliiraj, wiater Pandcy also all the staff My compliment for having such a good staff. Next time I will come to Kathmandu i will come back to your hotelDear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Shuba S",
          "text": "Thank you very much for this nice experience. This 1 hour Mount Everest sightseeing is best. To every one who want to see the Himalayan in easy way with best price. They pick up from hotel and even drop to hotel by private transport it’s very easy trip.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "SATISH K",
          "text": "Nice Himalayan view. Good airlines good driver Mr Deepak we really enjoy the trip of mountain flight. Thanks welcome Nepal treks team for trip. Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        }
      ],
      "rate": "5.042 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d19499705-1_Hour_Mount_Everest_flight_from_Kathmandu_With_Hotel_Pick_Up-Kathmandu_Kathmandu_.html",
      "categoryId": "6463c2109ae7fcd265eb30cf"
    }
  ]
}
