{
  "data": [
    {
      "pid": null,
      "name": "Nagarkot Sunrise View and Day Hiking from Kathmandu",
      "price": "from $85.00 per adult (price varies by group size)",
      "location": "",
      "about": "A mountain village in Nepal, Nagarkot is famous for its sunrise views over the Himalayas. On this tour from Kathmandu, enjoy an early morning panorama over world-renowned peaks before a scenic hike to Changu Narayan. Visit other villages as you make your way through the country’s picturesque hillsides before arriving at the UNESCO-listed temple. A private guide means plenty of personal attention, and hotel pickup makes for a seamless experience.Me and my sister really enjoyed our trip to nagarkot and the hike to the hindu temple. It was great to get out of the craziness of kathmandu for the day and breath clean air up in the hills and watch the sunrise. It was a little foggy but we still had lovely views of langtang and the ganesh himal range.Our guide Bidur was friendly, chatty and answered all of our questions. It was interesting to learn about the mountains from him and also more about Nepali life and Hinduism. We didnt feel rushed and he took us for a lovely breakfast and offered us to stop for tea later in the day too.Would recommend to people who want to see how many nepali people live and have a short mountain escape from the valley and stretch their legs on a lovely downhill/flat walk. Thank you for the great day!Jen and HayHi Jennifer,\n\nThank you very much for taking a service with us and glad to know that you get good service from our guide. We are always focus how to improve our services and hope we are able to give you five star services in next time. Have a nice time!The Nargakot sunrise and day hike tour was a truly memorable experience for us. We got the best view of the sunrise over the Himalayan ranges from the Nargakot tower, which is a small tower in the middle of the viewpoint area. Following the sunrise was a breakfast paid by ourselves (not included in the tour) at a hotel recommended by our tour guide. After breakfast, we started the 13-km hike from Nargakot to Changu Narayan temple. The hike was easy and mostly downhills, taking us through the villages where we could see the daily life of Nepali people. We did the tour in late December so it was freezing during the sunrise, but afterwards the hike warmed us up and it got hot later in the sun. So one pro tip is layer up for the morning and get ready to leave your jackets in the car when the hike began.Communication with the tour organizer was fast and responsive. Our guide Som was also very helpful and knowledgeable. Would highly recommend this tour!Hi Bac,\n\n\"Happy New Year 2023.\"\n\nThank you very much for visiting Kathmandu and taking Nagarkot Sunrise and hiking with us. Glad to know that you loved this hiking. Looking forward to see you again. Namaste!We booked this tour to enjoy the trekking experiences and to see sunrise and mount Everest from Nagarkot View point in Nepal. It was well worth. We were lucky to see the sunrise view and Himalayas mountain chain due to weather permit and it was breathtaking. Breakfast was not that good. I was hoping to enjoy local nepalese cuisine.After breakfast, we went for trekking and it was nice experience short version of trekking through nepal local village. The last stop was at Changu Narayan - UNESCO World Heritage Site.  Our Guide Madan was experience and he explained well about the trekking experiences.Would recommend!!!Hello Thein,\n\nThank you so much for booking a trip with us. It's our great pleasure that you enjoyed your trip along with our guide Madan. But, we feel sorry that you can't get a chance to enjoy local Nepalese cuisine. We looked forward to serving you again in Nepal.I had a great time on this tour! Shishir was a very knowledgeable guide, always in good spirits! The hike is a good way to explore the countryside in Nepal, giving you a different perspective of Kathmandu.Everyone was on time and very responsive, despite the smog, we could still get a glimpse of the mountain ranges for sunrise. I recommend this tour!Hi Ivo,\n\nThank you for sharing your feedback about the trip and glad to know you liked this trip. As you understand that we can not control in the weather but service part is our major focus and glad that our guide Shisir able to offer you good service and the information. Looking forward to serve you in the future again for longer holidays. The transportation will bring you to the highest point, and from there walk downhill all the time (except 20min up, easy trek), passing by small villages and some temples.What could be improved: for the coffee break/breakfast at the start of the trek (at your on expense, obviously) could have been in a restaurant with an impressive view, instead of the so-so place they chose. As a positive, the restaurant restroom was very clean. The guide was a 10!! friendly, acknowledged and adapted his walking speed to our condition. He also does longer treks in the Anapurna range, so he was great to talk to!Hi Carolina,\n\nThank you so much for taking a service with us and glad you enjoyed this trip. We are trying to upgrade our service as much as we can in coming days and hope this COVID19 will stop. Global tourism is fighting with this COVID19 and we are too. Stay safe and god bless you. We hope to see you again for some other trips and feel free to book our trip again. Had a brilliant hike/tour with Bidur who was so friendly and chilled. We got collected from our hotel and driven up to the view point in time for the sunrise which was beautiful even with it being hazy. Afterward we went for breakfast followed by the hike. The hike from start to finish was was amazing, we passed through many little villages before arriving at Changu Narayan Temple. Bidur was very informative throughout and if we ever return to Nepal we will definitely book in again for a longer trek and would hope to do so with Bidur.Hi Karina,\n\nThank you so much for trust team of Himalayan Planet Adventures. We are glad to know you loved this trip with our guide and looking forward to serve you again in future. Namaste!Unfortunately we weren’t  able to see the mountains during the sunrise as the weather was hazy but Shishir made sure we still get a wonderful time during the tour. He was very professional and friendly, he would ho out of his way just to please you. I would recommend Shishir and this tour to anyone who wants to escape the busy streets of Kathmandu and get some fresh air in the mountains.Hi Laurens,\n\nThank you very much for your feedback and we highly appreciated. Sometime the weather doesn't allow the view and i think your time is crucial for the view. Anyway, you had a wonderful hike in nature and village and that is awesome part. we are extremely looking forward to serve you again. Namaste!The tour was amazing. From the sunrise in the morning to walking the hills of Nagarkot - it was simply a unique experience. Our guide Krishna was very easy to communicate with, we enjoyed his stories and he made sure we were comfortable at all times.Hello,\n\nThank you so much for taking the service with us. We are so glad to hear your kind words here in Trip Advisor. And, we looked forward to serving you in the future.The sunrise and hike was amazing, the experience is spectacular and could not recommend this enough. When you get to the spot for the sunrise be sure to climb the ladder to the outpost early on to get the best view (it fills up).Sarita was informative, professional and timely. We thoroughly enjoyed our home with her and she had a deep in depth knowledge of the local area. The hike itself is not too hard there is a mixture of up and down hill parts but overall fine.Recommend Sarita to anyone wishing to do this.Top tip: the sun sometimes is hidden by the clouds but wait long enough and you'll see it crack through the clouds!Hi Ajay,\n\nThank you very much for taking service with us and glad to know you loved this trip. Glad that our guide able to offer you good service and the information. Love to serve you again in the future. Namaste!We did not see the sunrise because of the fog. We then hiked for about two and a half hours and saw nothing significant. We were really disappointed that we never got to see the Himalayas (even after three hours after the sunrise). It is our impression that this is normal during this time of the season. I think it would be helpful to not sell this package during this times or warn folks.Glad we were taken to Bhaktapur Chng Narayan temple and dropped off at Bhaktapur Durbar Square.Hi David,\n\nThank you so much for your feedback and we highly appreciated your view. This trip is most famous trip in Kathmandu who want to experience the sunrise over Himalayas and want to see the local lifestyle. As you see many people loved this trip but in your case sometime the weather could be hazy or cloudy, it happened in your case. We try to give our best to our clients but not controlled over weather condition. Try next time for better season and love to see you again.",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/74/9d/df.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/08/81/e9/ad.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/74/9d/e0.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 11-70"
        },
        {
          "svg": "",
          "name": "Duration: 9h"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [
        "A sunrise Nagarkot trip with Changu Narayan hike",
        "Enjoy panoramic views over the Himalayas, followed by a gentle guided hike",
        "Stop along the route to enjoy local Newari delicacies in family-run shops",
        "Spend time exploring the UNESCO-listed temple that most visitors miss"
      ],
      "extra": [
        {
          "title": "What's included",
          "text": "Professional guideTransportation (hotel pickup & drop, air conditioned vehicle)Fees (admission, fuel surcharge, parking, entry)Entry/Admission - Nagarkot View TowerEntry/Admission - Changu NarayanFood and drinksGratuities"
        },
        {
          "title": "What to expect",
          "text": ""
        },
        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.We pick up from all hotels inside ring road including Boudha area, Bhaktapur and Nagarkot area. Airports:Tribhuvan Airport, Kathmandu NepalHotel pickup is offered. View the hotel list on our checkout page to see if yours is included among the pickup points.Returns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleInfants must sit on laps"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingIn the event of poor weather or bad traffic conditions, tour itinerary is subject to change without notice. No cancellations or refunds will be issued. See voucher for detailsWe recommend you bring warm clothing during winterNot recommended for travelers with back problemsNot recommended for pregnant travelersNo heart problems or other serious medical conditionsMost travelers can participateThis is a private tour/activity. Only your group will participate"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "Covid safety",
          "text": "Regular temperature checks for staffTemperature checks for tour participants upon arrivalFace masks required for travelers in public areasFace masks provided for travelersGuides required to regularly wash handsHand sanitizer available to travelers and staffTransportation vehicles regularly sanitizedContactless payment for gratuities and add-onsFace masks required for guides in public areasPaid stay-at-home policy for staff with symptomsSocial distancing enforced throughout experienceSafety precautions are provided by the property and are not checked by Tripadvisor for accuracy."
        },
        {
          "title": "FAQ",
          "text": "Changu NarayanNagarkot View TowerThamel"
        },
        {
          "title": "Help",
          "text": ""
        }
      ],
      "itinerary": [
        {
          "title": "Nagarkot View Tower",
          "text": "Stop: 10 minutes  "
        },
        {
          "title": "Nagarkot Buddha Peace Park Hiking Trail",
          "text": "Stop: 30 minutes - Admission included"
        },
        {
          "title": "Changu NarayanPass by",
          "text": ""
        },
        {
          "title": "You'll return to the starting point",
          "text": ""
        }
      ],
      "reviews": [
        {
          "name": "Jennifer S",
          "text": "Me and my sister really enjoyed our trip to nagarkot and the hike to the hindu temple. It was great to get out of the craziness of kathmandu for the day and breath clean air up in the hills and watch the sunrise. It was a little foggy but we still had lovely views of langtang and the ganesh himal range.Our guide Bidur was friendly, chatty and answered all of our questions. It was interesting to learn about the mountains from him and also more about Nepali life and Hinduism. We didnt feel rushed and he took us for a lovely breakfast and offered us to stop for tea later in the day too.Would recommend to people who want to see how many nepali people live and have a short mountain escape from the valley and stretch their legs on a lovely downhill/flat walk. Thank you for the great day!Jen and HayHi Jennifer,\n\nThank you very much for taking a service with us and glad to know that you get good service from our guide. We are always focus how to improve our services and hope we are able to give you five star services in next time. Have a nice time!"
        },
        {
          "name": "thanhbac91",
          "text": "The Nargakot sunrise and day hike tour was a truly memorable experience for us. We got the best view of the sunrise over the Himalayan ranges from the Nargakot tower, which is a small tower in the middle of the viewpoint area. Following the sunrise was a breakfast paid by ourselves (not included in the tour) at a hotel recommended by our tour guide. After breakfast, we started the 13-km hike from Nargakot to Changu Narayan temple. The hike was easy and mostly downhills, taking us through the villages where we could see the daily life of Nepali people. We did the tour in late December so it was freezing during the sunrise, but afterwards the hike warmed us up and it got hot later in the sun. So one pro tip is layer up for the morning and get ready to leave your jackets in the car when the hike began.Communication with the tour organizer was fast and responsive. Our guide Som was also very helpful and knowledgeable. Would highly recommend this tour!Hi Bac,\n\n\"Happy New Year 2023.\"\n\nThank you very much for visiting Kathmandu and taking Nagarkot Sunrise and hiking with us. Glad to know that you loved this hiking. Looking forward to see you again. Namaste!"
        },
        {
          "name": "Thein P",
          "text": "We booked this tour to enjoy the trekking experiences and to see sunrise and mount Everest from Nagarkot View point in Nepal. It was well worth. We were lucky to see the sunrise view and Himalayas mountain chain due to weather permit and it was breathtaking. Breakfast was not that good. I was hoping to enjoy local nepalese cuisine.After breakfast, we went for trekking and it was nice experience short version of trekking through nepal local village. The last stop was at Changu Narayan - UNESCO World Heritage Site.  Our Guide Madan was experience and he explained well about the trekking experiences.Would recommend!!!Hello Thein,\n\nThank you so much for booking a trip with us. It's our great pleasure that you enjoyed your trip along with our guide Madan. But, we feel sorry that you can't get a chance to enjoy local Nepalese cuisine. We looked forward to serving you again in Nepal."
        },
        {
          "name": "Ivo Correia",
          "text": "I had a great time on this tour! Shishir was a very knowledgeable guide, always in good spirits! The hike is a good way to explore the countryside in Nepal, giving you a different perspective of Kathmandu.Everyone was on time and very responsive, despite the smog, we could still get a glimpse of the mountain ranges for sunrise. I recommend this tour!Hi Ivo,\n\nThank you for sharing your feedback about the trip and glad to know you liked this trip. As you understand that we can not control in the weather but service part is our major focus and glad that our guide Shisir able to offer you good service and the information. Looking forward to serve you in the future again for longer holidays. "
        },
        {
          "name": "Carolina C",
          "text": "The transportation will bring you to the highest point, and from there walk downhill all the time (except 20min up, easy trek), passing by small villages and some temples.What could be improved: for the coffee break/breakfast at the start of the trek (at your on expense, obviously) could have been in a restaurant with an impressive view, instead of the so-so place they chose. As a positive, the restaurant restroom was very clean. The guide was a 10!! friendly, acknowledged and adapted his walking speed to our condition. He also does longer treks in the Anapurna range, so he was great to talk to!Hi Carolina,\n\nThank you so much for taking a service with us and glad you enjoyed this trip. We are trying to upgrade our service as much as we can in coming days and hope this COVID19 will stop. Global tourism is fighting with this COVID19 and we are too. Stay safe and god bless you. We hope to see you again for some other trips and feel free to book our trip again. "
        }
      ],
      "rate": "5.0239 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d11469615-Nagarkot_Sunrise_View_and_Day_Hiking_from_Kathmandu-Kathmandu_Kathmandu_Valley_Bag.html",
      "categoryId": "0"
    },
    {
      "pid": null,
      "name": "Jungle Towernight Stay In Chitwan National Park ,nepal-2 Nights 3 Days Package",
      "price": "from $225.65$203.08 per adult",
      "location": "",
      "about": "The staff is very nice and attentive to your preferences and demand. The rooms were clean but the shower wasn’t working… in terms of food, it was okay but lacked quality. It is easy to go out to the nearby restaurant where they serve very good traditional food. Overall great experience with the staff, less with the hotel. Dear Leonie & Severin , \n\nNamaste and warm Greetings , \n\nWe had great time serving you in Chitwan for 3 nights which consisted customized package of Full day Jeep safari where you saw 35 Rhino in 1 day , Couple of Sloth Bears ,  Crocodiles, Deers , many birds and many other animals . The Guide Gopal provided to you was one if the  best one here  , which you also loved during your trip . \n\nNext night in Tower you spotted couples of rhino crossing the river from your balcony . \n\nDuring you departure you provides so many positives of the tour and told sleeping inside the tower was amazing experience . \n\nBut in this review we feel little sad to see only comment about the food and less about the jungle experience you had with us . \n\nThe food we provided did not hit your taste buds and was not be as per you preference , so we are sorry about it , so we will for sure improve on this . This is first time we had the food comment towards us , which will for sure help us improve . \n\nWe had few suggestions from Severin about improving which we are thankful and for sure we improve in it .  During tower nights due to the Jungle rules we should take packed dinner and we do not have access to coffee and hot water , but we will try to resolve the issue . \n\nWe had great time with you during your stay and organizing your trip . \n\nWe hope to see you next time and will love to serve you the upgraded version of us . \n\nThank you \n\nRegards ,\nOwner\nA truly magical experience, a must for any animal lovers. Fromm the excellent guide to the fantastic hotel staff a must for all. An early morning wake up call from a rhino bathing, to a wild elephant coming out of the mist all witnessed from our treehouse, something that isn’t possible from any other safari.Upwards n returning to the hotel for a night we were greeted with courteous staff and fantastic food, I cannot believe the level of service and food receive for the price paid.A must for all.Dear Jon , \n\nNamaste\n\nThank you for choosing The towernight stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangamSungam is the best!!! He arranged everything for us so we could have the most perfect stay in Chitwan. The hotel rooms were very nice and comfy, and the food was so delicious! The customer service was truly incredible that we received including all the extra cut up watermelon. Additionally, all the jungle activities arranged were spectacular. Our guide Gopa was the best guide ever. He had such an incredible eye for spotting wildlife and was such a kind soul and had an awesome energy about him. Gopa was so knowledgeable and the best guide in chitwan- he made us feel safe and helped us appreciate the nature with all his fun facts and incredible spirit. We loved Gopa and the jungle safaris including the boat, walking tour, jeep and incredible night in the jungle tower. This was truly a once-in-a lifetime experience and I would come back again in a heartbeat with this same company and Gopa. If you want to have the most incredible experience in Chitwan, Sungam is your guy to ensure that! A special shoutout to Sungam for all the extra stuff he arranged for us, including an elephant safari, we sincerely appreciated it! Dear Katie , \n\nNamaste\n\nThank you for choosing The towernight stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangamThe real jungle safari experience was felt here .Jungle tower was very comfortable and in perfect place to spot animals .The boat trip , jungle walk , jeep safari was organized by the very friendly nature Guide.Mr Hemanta our guide  was very friendly and always attentive for our satisfaction Highly recommended and will be back another timeDear Mausam , \n\nThank you for selecting us for your safari trip . \nWith you  we had amazing time as we saw many wild animals .\n\nwe look forward to welcome you again \n\nRegards, \nSangam GhimireAwesome service, very comfortable rooms. Extremely helpful organising all activities and helping with last minute travel arrangements. Food choice is limited but town is very close with plenty of local places to eat! Our guide (for jungle walk/safari) was awesome - highly recommend asking for Gapur. Really knowledgeable and v v friendly.  Saw many rhinos in the overnight stay in the jungle tower!Dear Sam , \n\nNamaste\n\nThank you for choosing The towernight stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangamThe opportunity to get up close and personal with the river and jungle environment and it's species made this a much richer experience we went down river for 45 minutes seeing a variety of birds and crocodiles. Redis embarked and hiked on trail 45 minutes seeing a massive rhinoceros eating grass next to the trail. The tower itself is exactly correct. A three-story structure embedded in the jungle. We observe multiple bird species. Monkeys in the trees fell asleep to the sounds of the forest. Highly recommendedDear Michael ,   \n\nNamaste  \n\nThank you for choosing The towernight stay with us .  \n\nThank you for the amazing review . \n  \nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us .  \n\nConnecting with you was memorable through the jungle tour .  \n\nSee you soon in near future  \n\nRegards\nSangamThe jungle tower stay 3 day package is a great way to experience the unique wildlife of Nepal. We had an amazing Ranger full of knowledge who had great English. We saw plenty rhinos, crocs, moneys, birds and even a bear with her cub! The safari hotel was also a great place to stay, being exceptionally clean and containing modern facilities, Sangam, Sujan and their team went above and beyond to make sure our stay was enjoyable as possible. Next time I’m in Chitwan I’d definitely be staying with these guys again.Dear Hue, \n\nNamaste\n\nThank you for choosing The towernight stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangamAfter the  busy Katmandu, coming here to The Park and staying with Sangam at the resort has been something I will always remember. 10/10 experience like no other. Thankyou to Repal my expert jungle guide and his security guide. This will rate amongst my top trips ever. The animals and the national park are majestic!Dear James ,   \n\nNamaste  \n\nThank you for choosing The towernight stay with us .  \n\nThank you for the amazing review . \n  \nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us .  \n\nConnecting with you was memorable through the jungle tour .  \n\nSee you soon in near future  \n\nRegards\nSangamVery Nice experience, we Saw rhinos and a lot of other cool animals.Our guide Gopal was amazing and helped us a lot because we were a bit sick when we arrived.He was very dedicated to his work and had a passion for it. If your doing it, ask if gopal can be your guide! :)Dear Anton , \n\nNamaste\n\nThank you for choosing The tower-night stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangamAll of it! The hotel is beautiful, has AC, toiletries, even toothbrush and toothpaste. Food is delicious, al employees are nice and helpful, the guides are amazing. I did the Safari jungle tour, the river and the walking by the river. The beauty of it is incredible. It's peaceful and so relaxing.Dear Guest , \n\nIt was a pleasant time serving you here in Chitwan . Happy to hear that you loved the trip we provided for you . \nSee you in chitwan for little longer stay . \n\nSee you next time . \n\nRegards ,\nSangam Ghimire",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/a8/ea/7b.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/a5/5e/c6.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/11/88/5d/a1.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 0-100, max of 8 per group"
        },
        {
          "svg": "",
          "name": "Duration: 3 days"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        },
        {
          "svg": "",
          "name": "Features animals"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "Jeep SafariCanoe Ride (Boating )Experience Nature GuideJungle Walk + Bird Watching (As per guest interest )All Meal ( 2 Lunch , 2 Dinner , 2 Breakfast )All Fees and TaxesAir-conditioned vehicleAccommodations ( 1 Nights in Jungle Tower & 1 night in Deluxe Hotel rooms )Alcoholic BeveragesPrivate transportationJungle safari clothes ( dark colour clothes : leaf green , brown , grey ) "
        },
        {
          "title": "What to expect",
          "text": ""
        },
        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.We provide Transportation Service in Tourist coach from Kathmandu , Chitwan. or Pokhara . We have our representative in all three main city of Nepal . \nThe pick up time is mentioned in 24 hr , because we want to meet clients 1 day before explain all details individually , so that it will be more experience for clients . Jungle Safari Resort, Sauraha, Ratnanagar 44200, Main Road Sauraha, Chitwan Nepal 44200, Nepal\nWe provide pick up from Kathmandu , Chitwan. or Pokhara . We have our representative in all three main city of Nepal . \n\nWe have tourist coach from Kathmandu and Pokhara . \nThe coach tickets is included in the price\nAirports:Bharatpur Airport, Bharatpur NepalPorts:Tourist Bus Stop, Nayabazar 16, Kathmandu 44600, NepalOther:Tourist Bus Stop, Nayabazar 16, Kathmandu 44600, Nepal\nWe have daily air-conditioned tourist coach from Kathmandu to Chitwan . Once you book the trip we send you the bus tickets and details . Returns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleNear public transportationInfant seats available"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingNot recommended for pregnant travelersNo heart problems or other serious medical conditionsMost travelers can participateThis experience requires good weather. If it’s canceled due to poor weather, you’ll be offered a different date or a full refundThis tour/activity will have a maximum of 8 travelers"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "FAQ",
          "text": ""
        },
        {
          "title": "Help",
          "text": ""
        }
      ],
      "itinerary": [],
      "reviews": [
        {
          "name": "Léonie M",
          "text": "The staff is very nice and attentive to your preferences and demand. The rooms were clean but the shower wasn’t working… in terms of food, it was okay but lacked quality. It is easy to go out to the nearby restaurant where they serve very good traditional food. Overall great experience with the staff, less with the hotel. Dear Leonie & Severin , \n\nNamaste and warm Greetings , \n\nWe had great time serving you in Chitwan for 3 nights which consisted customized package of Full day Jeep safari where you saw 35 Rhino in 1 day , Couple of Sloth Bears ,  Crocodiles, Deers , many birds and many other animals . The Guide Gopal provided to you was one if the  best one here  , which you also loved during your trip . \n\nNext night in Tower you spotted couples of rhino crossing the river from your balcony . \n\nDuring you departure you provides so many positives of the tour and told sleeping inside the tower was amazing experience . \n\nBut in this review we feel little sad to see only comment about the food and less about the jungle experience you had with us . \n\nThe food we provided did not hit your taste buds and was not be as per you preference , so we are sorry about it , so we will for sure improve on this . This is first time we had the food comment towards us , which will for sure help us improve . \n\nWe had few suggestions from Severin about improving which we are thankful and for sure we improve in it .  During tower nights due to the Jungle rules we should take packed dinner and we do not have access to coffee and hot water , but we will try to resolve the issue . \n\nWe had great time with you during your stay and organizing your trip . \n\nWe hope to see you next time and will love to serve you the upgraded version of us . \n\nThank you \n\nRegards ,\nOwner\n"
        },
        {
          "name": "Jon G",
          "text": "A truly magical experience, a must for any animal lovers. Fromm the excellent guide to the fantastic hotel staff a must for all. An early morning wake up call from a rhino bathing, to a wild elephant coming out of the mist all witnessed from our treehouse, something that isn’t possible from any other safari.Upwards n returning to the hotel for a night we were greeted with courteous staff and fantastic food, I cannot believe the level of service and food receive for the price paid.A must for all.Dear Jon , \n\nNamaste\n\nThank you for choosing The towernight stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangam"
        },
        {
          "name": "Katie B",
          "text": "Sungam is the best!!! He arranged everything for us so we could have the most perfect stay in Chitwan. The hotel rooms were very nice and comfy, and the food was so delicious! The customer service was truly incredible that we received including all the extra cut up watermelon. Additionally, all the jungle activities arranged were spectacular. Our guide Gopa was the best guide ever. He had such an incredible eye for spotting wildlife and was such a kind soul and had an awesome energy about him. Gopa was so knowledgeable and the best guide in chitwan- he made us feel safe and helped us appreciate the nature with all his fun facts and incredible spirit. We loved Gopa and the jungle safaris including the boat, walking tour, jeep and incredible night in the jungle tower. This was truly a once-in-a lifetime experience and I would come back again in a heartbeat with this same company and Gopa. If you want to have the most incredible experience in Chitwan, Sungam is your guy to ensure that! A special shoutout to Sungam for all the extra stuff he arranged for us, including an elephant safari, we sincerely appreciated it! Dear Katie , \n\nNamaste\n\nThank you for choosing The towernight stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangam"
        },
        {
          "name": "Mausam Bala Khanal",
          "text": "The real jungle safari experience was felt here .Jungle tower was very comfortable and in perfect place to spot animals .The boat trip , jungle walk , jeep safari was organized by the very friendly nature Guide.Mr Hemanta our guide  was very friendly and always attentive for our satisfaction Highly recommended and will be back another timeDear Mausam , \n\nThank you for selecting us for your safari trip . \nWith you  we had amazing time as we saw many wild animals .\n\nwe look forward to welcome you again \n\nRegards, \nSangam Ghimire"
        },
        {
          "name": "sam g",
          "text": "Awesome service, very comfortable rooms. Extremely helpful organising all activities and helping with last minute travel arrangements. Food choice is limited but town is very close with plenty of local places to eat! Our guide (for jungle walk/safari) was awesome - highly recommend asking for Gapur. Really knowledgeable and v v friendly.  Saw many rhinos in the overnight stay in the jungle tower!Dear Sam , \n\nNamaste\n\nThank you for choosing The towernight stay with us . \n\nThank you for the amazing review . \n\nWelcoming you in Chitwan and serving you with the jungle tour was amazing for us . \nConnecting with you was memorable through the jungle tour .\n\nSee you soon in near future\n\nRegards\nSangam"
        }
      ],
      "rate": "5.032 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g1367591-d19422647-Jungle_Towernight_Stay_In_Chitwan_National_Park_nepal_2_Nights_3_Days_Package-Sau.html",
      "categoryId": "0"
    },
    {
      "pid": null,
      "name": "Everest Base Camp Trek - 14 Days",
      "price": "from $1,500.00 per adult",
      "location": "",
      "about": "Firstly I’ll start by saying that doing the Basecamp trek in winter is extremely difficult. The actual walking was easy, it had a few hard parts but overall quite a good trek. The hard part was dealing with the cold especially coming from Australia when it’s been over 30+ degrees and coming into temperatures of -20 to -30 degrees. The altitude was a hard one to judge. Sometimes you felt great and then other times you walked 15 metres and you we’re out of breath. Overall the trek was amazing but I think I would’ve definitely preferred it in the summertime. My guides name is Pasang Dawa who works for Ace the Himalayas. He’s very good at speaking English which was very helpful because a lot of other guides struggled with that. He was very caring and always put others before himself. I fainted one morning and he was there by my side the whole time making sure I was alright and my partner had a sore back so he straight away volunteered to carry her bags for her for a few days. He also helped the other couple we were with in their own ways and he overall was a perfect guide and someone I’d definitely recommend if I was wanting to find the perfect guide. If I came back I’d request Pasang again because he is very loyal and cares about everyone else before himself. He also knows a lot about each mountain and any information we asked him he knew exactly what to say. We also had Resham (another guide) who helped our group out a lot. He was assigned to another climber who decided to stay with us because her trek was to hard to do. He was really helpful and very kind. He’s a very good guide and knows a lot about the mountains but he just need to work on his English a little. That’s the only fault I have to say about him because he was so amazing. Both guides were amazing and we were very lucky to have them both.Ace the Himalayas had a good pre trip meeting which helped a lot to understand everything about the trip. They do have a couple faults which can be fixed easily. One being the item list (clothing, equipment etc) for winter needs to be longer because there were a few things which would’ve been helpful if we knew about it before we started hiking.Overall the trip was amazing. The guides we had were great and made the trip so much easier and we always felt very safe with them.What an incredible adventure! We had an amazing trip with Ace the Himalaya and could not recommend them enough. From the minute we booked we were impressed with the communication from Lokesh and the team who speedily answered all of our questions and provided us with a comprehensive pre-trek packing list.When we arrived in Kathmandu, our trek manager Sajiya gave us a comprehensive outline of the itinerary and what to expect which prepared us for all eventualities. We struck gold with Madan as our tour guide. Over the course of the two weeks he went from guide to friend to family. Madan having done over 200 treks had so much knowledge of not only the Himalayas but also medical knowledge on how to minimise the chances of altitude sickness, which none of us got. Because of him, we were able to achieve 100% success rate with all members of our group not only making base camp, but also making the difficult yet rewarding trek up Kala Patthar. Madan kept us laughing, even when we were altitude trekking in -17 degrees! He kept us humble with the number of times he beat us at UNO, and always reminded us to stop and admire the view. He was constantly checking for altitude sickness so we felt safe and well cared for. He even brought up a pulse oximeter to check our oxygen levels. His passion about preserving the beauty of the Himalayas and caring for its people was infectious, and he helped us recognise the importance of sustainable trekking.Our wonderful Porters Raj and Dhan made the trek much easier for us and were always there if we needed help. We couldn't have done it without them. Dhan especially was like a second guide and joined us for acclimatisation treks and the trek to base camp.Overall this was the a trek of the lifetime. Going with Ace the Himalaya made it the perfect trip.Having just finished our Everest Base Camp trek with Ace the Himalaya, it is hard to find the words to describe how amazing our experience has been. From start to finish Ace the Himalaya team has been outstanding. We booked 5 months before our trek and it started with Lokesh in the office answering patiently and diligently all of my questions to help prepare for the winter trek. Lokesh made us feel that we were in good hands from the start.Our trek began at the airport pick up, when our guide Madan Kandel and a driver picked us up. Although our flight was delayed the team and Ms Sajiya waited for us to ensure we had a proper briefing before our trek. We could not have asked for better service! As for the trek, what an incredible experience! Madan was absolutely amazing, enhancing the trek at all levels. First of all he made us feel safe, from the flight to Lukla to anything along the way. I got a cold on Day 3 and started to feel the effect of the cold temperatures early on, Madan always arranged extra blankets, extra great food, and checked in on us to ensure we were well, happy and safe. Madan is very knowledgeable and has done Everest Base Camp over 200 times! His patience, fun nature and gentle soul made him the absolute best guide! We could not have wished for a better one.From Lobuche guesthouse to Base Camp I felt the effect of altitude sickness and can honestly say that without Madan’s support and expert advice I would not have been able to complete the trek. I’m so happy he was our guide, and wish that he wins the Ace the Himalaya guide of the year award a second time! Lastly and not least, we cannot complete this review without mentioning our porter Dhan. What a legend! Dhan carried our overnight bags, every day no matter the weather. He was the man in the shadows, always early and bringing our bags before we arrived. We loved Dhan’s company on the last night and hope he can become an assistant guide soon. If you are wondering which company to book your trek with, do not hesitate and trust Ace the Himalaya.I started the Everest Base Camp trek with Nimesh in March 2019, and I absolutely loved having him as my guide.  At every step, from the initial pre-trip meeting to handling flights to Lukla to directing the porters and dealing with our crazy group, Nimesh was kind, patient, steadfast and intelligent.  I hurt my ankle in Namche Bazaar and, since I insisted on continuing, Nimesh quickly arranged a horse and horseman to take me to Tengboche.  He treated my ankle that night with knowledge and care.  When the next morning it became apparent I could not go on, he immediately called a helicopter and had me on it in less than 20 minutes, then had his friend meet me in Lukla to meet the helicopter and arrange the flight back to Kathmandu.  I can’t imagine what it would have been like to try to do all this myself, but Nimesh handled the situation with empathy and urgency.  Nimesh’s insight into the culture, expert counsel to his clients and skill on the trail are beyond compare.  Plus, he’s a great conversationalist and very funny, and truly wants to learn about his clients.I am returning this year for another EBC trip with Ace, and insisted on having Nimesh as my guide—because I wanted the best, and that’s what he is.  I can’t wait!What an incredible experience! This trip would not have the same memories if not for the experience and knowledge of the Ace the Himalaya team.Sajiya handles much of the logistics and was more than willing to answer any and all questions that my group had before we even stepped into our plane.Their years of experience helped to make us aware of any potential changes to our itinerary beforehand and really helped to give us peace of mind. There a lot of moving parts to make a trip like this happen but good weather is never guaranteed for flights into or out of Lukla. Our trek was delayed by a day due to weather but our guide, Pasang, had things well in hand and pre-arranged for us to stay at a local hotel before the weather cleared the next morning.Pasang, his assistant Sunny, and the Porters worked incredibly hard to make sure our group was well taken care of. We never felt rushed and Pasang did an amazing job of managing the faster hikers and the slower hikers so that we each had our own experience and not forced to stay together.I would highly recommend Ace the Himalaya to anyone thinking of booking their next trip to the Nepal region! Thank you Sajiya, Pasang and the Ace team for a wonderful experience!Excellent trek guided by Ace. Ravi, Ramesh, and Raj did a great job working with a large group of varying skill levels. A fun group of guides to be around who made sure the group took the time to adjust to the elevation and took their time to set up a sustainable pace. They attended to the group making sure people made it to destinations safely and coped with the elevation increase.When I was a kid I received a book on the visual atlas of the world as a gift and it gave me the inspiration to see the world. Fast forward twenty years and I feel extremely fortunate to have been able to visit many diverse parts of the world, but what I can confidently say is that the Khumbu region is one of the top three places I have visited so far in my life. The Himalayas, and specifically Nepal, have been at the top of my list of places to visit for years and trekking to Everest not only exceeded my already lofty expectations but belongs in its own league of travel experiences. As far as organizing the trek, Ace the Himalaya did an amazing job at accommodating me at the last minute because I only confirmed my plans to trek two days before my flight to Lukla. Due to the pandemic and the dramatically lower tourist numbers as a result, it was possible to do this but once tourist numbers start to normalize again, I would highly recommend advanced planning for a trek. My guide was Raj (Rajkumar), and he is a great guide who is very knowledgable with the Khumbu region. Every question I had about culture or a specific mountain he seemed to have an in-depth answer.  On the acclimatization hike from Dingboche, Raj also chose to carry my backpack, which I really appreciated because I was feeling the effects of altitude that day. My porter (I'm not sure how to spell his name) was also great. Without his help, I wouldn't have been able to complete this trek. Two other notable people I met are Sajiya and Lokesh. Sajiya is a cool girl who manages operations at the office and seems to have a lot of pride in her country. She spoke great English and I enjoyed our conversations the couple times we met. Last but not least, Lokesh was the person I was communicating by email with prior to going to Nepal and he answered many of my questions that helped ease some of the uncertainty I felt about the trek.Just a few last things I want to note about the trek. I personally started to feel the effects of altitude at Dingboche (4,350m/14,270 ft) and I noticed a lot of other people did as well. The days in Dingboche, Lobuche, and Gorak Shep made me feel a little discomfort but the effects of altitude generally felt mild. Teahouse accommodation is basic but it's manageable. Food quality and choices seemed constant throughout the trek. Overall, I would definitely come back to Nepal and do a tour with Ace the Himalaya again. There are so many companies to choose from, but I think what makes Ace the Himalaya stand out is their online presence that shows a proven track record of people who have had great experiences in the Himalayas. That is what caught my attention before traveling to Nepal, and now I can personally say that Ace the Himalaya is the easy choice when it comes to trekking in Nepal. If you want to see the Himalayas then I would recommend just doing the mountain flight or Everest helicopter tour. But if you want to experience the Himalayas and the culture of the Tibetan and Sherpa people while being in the shadows of several of the world's highest mountains, then trekking to Everest may be one of the best things you can do in life.Dear Stephen,\n\nThank you very much for taking some time to write this detailed review. The title of your review itself is very encouraging. We are very glad to know how beautiful time you had in Nepal trek. The way you have shared your experiences on the trek especially focusing Khumbu Region is absolutely phenomenal. Everest Region is definitely not an easy trek and the way you have elaborated your experiences could be really helpful to all the traveler/ trekkers from the world especially who are planning to trip to Nepal. So we are extremely thankful for this. Lastly we agree on how you have also acknowledged on our team members. Your guide Rajkumar, your porter, Sajiya and Lokesh from our operations indeed are the hardworking team who tried their best to contribute from all the aspects in order to make our client’s trip successful. They would be very happy to get this appreciation. We really hope to see you again in the future. Stay Safe!Having never hiked before or visited Nepal, I was unsure which trekking company to enlist for my adventure. When researching which company to use, I was at first sceptical of the overwhelmingly positive reviews Ace had received from their previous guests. Now that I have completed my trek up Mt. Everest with Ace, I can confirm that all these reviews do not even begin to do this company justice! Ace places their guests’ experiences and safety at the very heart of their business. From the minute you land in Kathmandu, to when they drop you off at the departures lounge, Ace is there to look after your ever need (24/7) and ensure you’re having the best time possible! It is a very slick operation they have built; their communication / response time from the very first day of booking has been exceptional. The 14 day trek up Mt. Everest is a once in a lifetime trip. It is a very challenging exercise, however with our guide Milan by our side 24/7, constantly providing us with support, banter and assurance, the entire group was able to reach Base Camp. Milan is hands down the best guide Ace has, and I highly recommend requesting Milan in advance for when making your booking. His language abilities and very caring nature put our entire group at ease from day one, and we have left as lifelong friends. He is extremely knowledgeable of the terrain and I never once felt uncomfortable in my surroundings. Milan goes over and above to pass on his extensive  knowledge of the rich history of this amazing country. Finally, two of the greatest assets that Ace had to offer is their stance on coping with Altitude Sickness, and their vast network within the Nepali tourism industry. Milan ensured from day one we had the correct amount of water at all times, moved at a pace which was comfortable for everyone in the group, and ate the appropriate food to help our recovery. Ace has been operating for over a decade, and has worked to secure the first flights in/out of Lukla (very important) and the “best” rooms in the tea houses. I hope this review helps you to decide that Ace is the trekking company for you…. And if it does, I hope you chose Milan to take you up Mt. Everest, you won’t regret it!The magnitude of completing an EBC trek is not fully realised until days and weeks or reflection are absorbed.Our Ace manager Sajiya briefed us comprehensively on trekking conditions and our schedule prior to departing, and organised our resort accommodation (upon request) at our return. Her attention to detail is reassuring to say the least, we had absolute confidence in her helmsmanship of Ace from there on in.  For our first experience abroad, in hindsight, we wouldn't change a single detail.Picked up in the late evening from the airport by our plucky guide Deepesh, it became evident that his ownership of our Himalayan experience was personal. He sold the total package of EBC on his amicable, unflappable conduct. Throughout the entire trek Deepesh was right about wherever you needed him to be, whatever the requirement. His converse with the porters and hosts was on par, and he always negotiated an accord in our favour.One of the Himalayan heroes was our porter Kumar, always making himself available as the personal host. Many times Kumar would return unladen from despatching our baggage at accommodation and assist a struggling group member by taking a daypack or offering stimulating support. Having being blessed with good fitness, some days I delighted in catching up to Kumar climbing a pass during the days trek which would draw a chuckle and a positive response.In reflection our EBC advice is to go with Ace, go hard,  go prepared and go without expectations. Because the real reward will come later, reflecting on your journey a lifetime away in the warmth and comfort of your humble daily existenceTrekking to Everest Base Camp with Ace The Himalaya was an experience of a lifetime. Every single aspect of the journey was managed to perfection. Upon arrival at the airport, our guide was waiting to pick us up. He took us to our hotel, got us settled, and informed us of our next steps. Before starting our trek, we met with the Operations Manager of Ace to discuss in detail the trek and what we should expect. She was extremely thorough and left us with every question we had answered. The trek itself was incredible. Our guide, Raj, and porter, Sauman, were the best. They were funny, knowledgeable, and were an absolute pleasure to trek with. They made sure we had everything was just right and went above and beyond to make sure our every need was met. If you get the pleasure to trek with Raj and Sauman you will have one of the best experiences of your life. After the trek was completed we had a post-meeting with the Operations Manager to discuss how the trek went. Ace even helped us set up transportation to and from the hospital to get a PCR COVID test needed to depart for our home country 5 days AFTER our trek was completed. I highly highly recommend Ace The Himalaya if you want a trek to Everest Base Camp that will leave you with an experience that was better than you could have ever imagined.Dear Erica,\n\nWe really appreciate your valuable time for this review. Thank you very much for choosing us and giving us chance to organize trek for you.  We understand how important this trip carries for our clients so we try our best to make them happy and carry the lifetime experiences back home. Our whole team members are always ahead to contribute from their part to make trip successful and we are very glad we succeeded in yours too via this reviews. Your acknowledgement on the duties of our Operation Manager to our hardworking guide Raj (Rajendra), porter Sauman and overall staff really encourages to work more efficiently and provide best services. We hope to continue this in future too. Thank you for trekking with us. Feel free to plan your other trips with us anytime. See you in the mountains. Stay Safe!\n",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/07/87/2f/a9.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/0b/91/13/7b.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/0b/91/13/a5.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 8-75, max of 14 per group"
        },
        {
          "svg": "",
          "name": "Duration: 14 days"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "DinnerBreakfastDinnerLunchBreakfastDinnerDinnerBreakfastBreakfastDinnerLunchBreakfastLunchBreakfastLunchLunchBreakfastDinnerLunchDinnerBreakfastBreakfastBreakfastDinnerBreakfastDinnerDinnerDinnerBreakfastLunchDinnerLunchLunchBreakfastLunchLunchAirport/hotel transfers in private tourist vehicle3-star twin-share accommodation in Kathmandu (2 nights); breakfast includedTwin-sharing guesthouse accommodation in the trek with attached toilets in Lukla, Phakding & NamcheFirst-aid trained, government licensed English-speaking trekking guide Porter service for 11 days (1 porter for 2 clients). Food, accommodation, salary, insurance, equipment and medicine for all staffEverest/Sagarmatha National Park entry permit and Pasang Lhamu Rural Municipality fee for trekking. Airfare for Kathmandu-Lukla-Kathmandu sector including airport departure taxAce the Himalaya’s duffel, trekking map, sun hat and trip completion certificate (yours to keep)A comprehensive first-aid kit and arrangements for emergency medical evacuation in worst scenario. All our government taxes, tourist service charges, official expensesFiltered water in the trails using Katadyn Pocket Water FilterSeasonal fruits during the trekAll your standard meals during the trek (Breakfast, Lunch, and Dinner)Lunch and dinner in Kathmandu.Travel insurance covering emergency high-altitude rescue and evacuationInternational airfare and airport departure taxNepal visa which you can get easily upon arrival Alcoholic, hot and cold drinksPersonal trekking equipmentTips for guide and porter. (Tipping is expected.)Any others expenses that are not mentioned in the Included section"
        },
        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.Our airport representative will be waiting for you outside the terminal building holding Ace the Himalaya signboard. Once he receives you, he will direct you our tourist vehicle which will bring you to the hotel. Kathmandu 44600, NepalAirports:Tribhuvan Airport, Kathmandu NepalReturns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleNear public transportation"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of booking The price is for 1 person based on two people booking. It is also valid for a single person booking. However, if we don't have an existing group for your chosen departure date or anyone to share the accommodation with you, a single surcharge of USD 200 is applicable which you need to pay upon your arrival in Nepal. At the time of booking, we will inform you if we have a group or not for your date. The single surcharge is also applicable if you don't want to join any group and want a solo departure. Domestic flight luggage allowance: 15 kgNot recommended for travelers with back problemsNot recommended for pregnant travelersNo heart problems or other serious medical conditionsTravelers should have a moderate physical fitness levelThis tour/activity will have a maximum of 14 travelers"
        },
        {
          "title": "Cancellation policy",
          "text": "If you cancel at least 7 days in advance of the scheduled departure, there is no cancellation fee.If you cancel between 3 and 6 day(s) in advance of the scheduled departure, there is a 50 percent cancellation fee.If you cancel within 2 days of the scheduled departure, there is a 100 percent cancellation fee."
        },
        {
          "title": "FAQ",
          "text": "Tengboche Gompa"
        },
        {
          "title": "Help",
          "text": ""
        }
      ],
      "itinerary": [],
      "reviews": [
        {
          "name": "Brodie Geisler",
          "text": "Firstly I’ll start by saying that doing the Basecamp trek in winter is extremely difficult. The actual walking was easy, it had a few hard parts but overall quite a good trek. The hard part was dealing with the cold especially coming from Australia when it’s been over 30+ degrees and coming into temperatures of -20 to -30 degrees. The altitude was a hard one to judge. Sometimes you felt great and then other times you walked 15 metres and you we’re out of breath. Overall the trek was amazing but I think I would’ve definitely preferred it in the summertime. My guides name is Pasang Dawa who works for Ace the Himalayas. He’s very good at speaking English which was very helpful because a lot of other guides struggled with that. He was very caring and always put others before himself. I fainted one morning and he was there by my side the whole time making sure I was alright and my partner had a sore back so he straight away volunteered to carry her bags for her for a few days. He also helped the other couple we were with in their own ways and he overall was a perfect guide and someone I’d definitely recommend if I was wanting to find the perfect guide. If I came back I’d request Pasang again because he is very loyal and cares about everyone else before himself. He also knows a lot about each mountain and any information we asked him he knew exactly what to say. We also had Resham (another guide) who helped our group out a lot. He was assigned to another climber who decided to stay with us because her trek was to hard to do. He was really helpful and very kind. He’s a very good guide and knows a lot about the mountains but he just need to work on his English a little. That’s the only fault I have to say about him because he was so amazing. Both guides were amazing and we were very lucky to have them both.Ace the Himalayas had a good pre trip meeting which helped a lot to understand everything about the trip. They do have a couple faults which can be fixed easily. One being the item list (clothing, equipment etc) for winter needs to be longer because there were a few things which would’ve been helpful if we knew about it before we started hiking.Overall the trip was amazing. The guides we had were great and made the trip so much easier and we always felt very safe with them."
        },
        {
          "name": "Melissa",
          "text": "What an incredible adventure! We had an amazing trip with Ace the Himalaya and could not recommend them enough. From the minute we booked we were impressed with the communication from Lokesh and the team who speedily answered all of our questions and provided us with a comprehensive pre-trek packing list.When we arrived in Kathmandu, our trek manager Sajiya gave us a comprehensive outline of the itinerary and what to expect which prepared us for all eventualities. We struck gold with Madan as our tour guide. Over the course of the two weeks he went from guide to friend to family. Madan having done over 200 treks had so much knowledge of not only the Himalayas but also medical knowledge on how to minimise the chances of altitude sickness, which none of us got. Because of him, we were able to achieve 100% success rate with all members of our group not only making base camp, but also making the difficult yet rewarding trek up Kala Patthar. Madan kept us laughing, even when we were altitude trekking in -17 degrees! He kept us humble with the number of times he beat us at UNO, and always reminded us to stop and admire the view. He was constantly checking for altitude sickness so we felt safe and well cared for. He even brought up a pulse oximeter to check our oxygen levels. His passion about preserving the beauty of the Himalayas and caring for its people was infectious, and he helped us recognise the importance of sustainable trekking.Our wonderful Porters Raj and Dhan made the trek much easier for us and were always there if we needed help. We couldn't have done it without them. Dhan especially was like a second guide and joined us for acclimatisation treks and the trek to base camp.Overall this was the a trek of the lifetime. Going with Ace the Himalaya made it the perfect trip."
        },
        {
          "name": "Julie C",
          "text": "Having just finished our Everest Base Camp trek with Ace the Himalaya, it is hard to find the words to describe how amazing our experience has been. From start to finish Ace the Himalaya team has been outstanding. We booked 5 months before our trek and it started with Lokesh in the office answering patiently and diligently all of my questions to help prepare for the winter trek. Lokesh made us feel that we were in good hands from the start.Our trek began at the airport pick up, when our guide Madan Kandel and a driver picked us up. Although our flight was delayed the team and Ms Sajiya waited for us to ensure we had a proper briefing before our trek. We could not have asked for better service! As for the trek, what an incredible experience! Madan was absolutely amazing, enhancing the trek at all levels. First of all he made us feel safe, from the flight to Lukla to anything along the way. I got a cold on Day 3 and started to feel the effect of the cold temperatures early on, Madan always arranged extra blankets, extra great food, and checked in on us to ensure we were well, happy and safe. Madan is very knowledgeable and has done Everest Base Camp over 200 times! His patience, fun nature and gentle soul made him the absolute best guide! We could not have wished for a better one.From Lobuche guesthouse to Base Camp I felt the effect of altitude sickness and can honestly say that without Madan’s support and expert advice I would not have been able to complete the trek. I’m so happy he was our guide, and wish that he wins the Ace the Himalaya guide of the year award a second time! Lastly and not least, we cannot complete this review without mentioning our porter Dhan. What a legend! Dhan carried our overnight bags, every day no matter the weather. He was the man in the shadows, always early and bringing our bags before we arrived. We loved Dhan’s company on the last night and hope he can become an assistant guide soon. If you are wondering which company to book your trek with, do not hesitate and trust Ace the Himalaya."
        },
        {
          "name": "Alison S",
          "text": "I started the Everest Base Camp trek with Nimesh in March 2019, and I absolutely loved having him as my guide.  At every step, from the initial pre-trip meeting to handling flights to Lukla to directing the porters and dealing with our crazy group, Nimesh was kind, patient, steadfast and intelligent.  I hurt my ankle in Namche Bazaar and, since I insisted on continuing, Nimesh quickly arranged a horse and horseman to take me to Tengboche.  He treated my ankle that night with knowledge and care.  When the next morning it became apparent I could not go on, he immediately called a helicopter and had me on it in less than 20 minutes, then had his friend meet me in Lukla to meet the helicopter and arrange the flight back to Kathmandu.  I can’t imagine what it would have been like to try to do all this myself, but Nimesh handled the situation with empathy and urgency.  Nimesh’s insight into the culture, expert counsel to his clients and skill on the trail are beyond compare.  Plus, he’s a great conversationalist and very funny, and truly wants to learn about his clients.I am returning this year for another EBC trip with Ace, and insisted on having Nimesh as my guide—because I wanted the best, and that’s what he is.  I can’t wait!"
        },
        {
          "name": "Ralph G",
          "text": "What an incredible experience! This trip would not have the same memories if not for the experience and knowledge of the Ace the Himalaya team.Sajiya handles much of the logistics and was more than willing to answer any and all questions that my group had before we even stepped into our plane.Their years of experience helped to make us aware of any potential changes to our itinerary beforehand and really helped to give us peace of mind. There a lot of moving parts to make a trip like this happen but good weather is never guaranteed for flights into or out of Lukla. Our trek was delayed by a day due to weather but our guide, Pasang, had things well in hand and pre-arranged for us to stay at a local hotel before the weather cleared the next morning.Pasang, his assistant Sunny, and the Porters worked incredibly hard to make sure our group was well taken care of. We never felt rushed and Pasang did an amazing job of managing the faster hikers and the slower hikers so that we each had our own experience and not forced to stay together.I would highly recommend Ace the Himalaya to anyone thinking of booking their next trip to the Nepal region! Thank you Sajiya, Pasang and the Ace team for a wonderful experience!"
        }
      ],
      "rate": "5.0694 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d13166235-Everest_Base_Camp_Trek_14_Days-Kathmandu_Kathmandu_Valley_Bagmati_Zone_Central_Reg.html",
      "categoryId": "0"
    },
    {
      "pid": null,
      "name": "Bhaktapur and Nagarkot Day Tour From Kathmandu",
      "price": "from $60.00 per adult (price varies by group size)",
      "location": "",
      "about": "I had a lovely day today with Kessar, a very friendly and extremely knowledgeable guide who explained in detail a lot of the things that we saw as we drove to our destination. The weather wasn't ideal today, but we still managed to see some peaks of the Himalayas. Then we went to the ancient city of Bhaktapur, where Kessar guided me through the parts, along with teachings of the local traditions, religions, and customs. I highly recommend this trip! No doubt the most stunning combination I did in Kathmandu valley. The view from Nargakot is just amazing, we had a nice cup of tea up there as well. Bhaktapur is the most lovely city in kathmandu valley, I could spend days there just enjoying life there with the stunning architecture and warm weather. I was in Bhaktapur the day before already so the friendly guide adapted his tour a bit. We talked quite a while about the unifying of the kingdoms of Nepal and the famous knife of the Nepali military. Very interesting stories about Nepals history.Prashant was an excellent tour guide. He was extremely knowledgeable and was a fun addition to the sightseeing. If you’re going to visit Bhaktapur, we HIGHLY recommend booking with Prashant and his company.Also, Bhaktapur is well worth seeing. It was definitely a highlight to our Nepal trip…Thanks Prashant 🙏My tour guide was Mukesh who was excellent if you have the opportunity to do the tour with him definitely take it, he was very knowledgeable and kind. The tour was amazing, the view you get from Nagarkot was one of the best views I have seen in my life. The view of the Himalayas in contrast to the valley filled with rice and potato farms was breathtaking. The rich culture, beautiful temples and wood carvings of Bahktapur was well worth it. I can recommend this tour as it is one I will not forget.On a three day stop over in Kathmandu I was so busy figuring out visas for India that I almost gave up on seeing the Himalaya mountain ranges until I found this trip.  Ask for KESHAR he’s a knowledgeable and sensitive guide, senior and who doesn’t just tell you dates and names, he brings you into the stories.  Would rebook it tomorrow. Thanks!An excellent tour with Dipesh who was able to provide lots of interesting information on Nepali culture, religion and architecture. Unfortunately we did not have good weather so we were not able to enjoy the views at Nagarkot. I was grateful for the umbrella when we were walking around the old city of BhaktapurDon't shop around, just do this one! It's an amazing tour. Our guide was Mukesh Shah and our driver was Rabi Pokhrel and they both went above and beyond to make sure our private day trip was beyond amazing. Very professional and knowledgeable.  Just truly amazing Nepali people as your hosts for the day. You will not regret it!!Really appreciated the historical insights and illustrative descriptions of our guide. Even though it was overcast in Nagorkot, the trip to Bhaktapur more than made up for it. Would definitely recommend this to any travelers who want to do a quick one-day tour of this historical site!We really enjoyed this tour. The view of Himalaya from Nagarkot is spectacular. Our guide Subash made sure we spend enough time to take in all the views. And the road to Nagarkot was a bit dangerous, with narrow one-lane winding dirt road uphill with cliff on the side. Our guide Subash particularly asked for a safe driver for the trip, since the driver for the previous day was not very safe. He also made sure that we saw the nice terrace crop field along the way. The ancient capital of Bhaktapur is also very nice. Subash made sure we take our time to see everything we want to see, and no rush us. Overall, we are very happy with the two-day tour with breakaway adventure private tour. The only thing we wish for improvement is to have a car with safety belt.We had a wonderful day-trip guided by wonderful Shankar whose endless well of knowledge enriched our day. Bhaktapur is a wonderous place, suffered in 2015 earthquake, but rebuild is well on the way. The original buildings are full of beautifully crafted details. Nagarkot views and fresh (mountain to us but just a hill to the locals) air where the second highlight of the day. Our driver Ravi expertly navigated the narrow and curvy roads. Thank you for a wonderful day!",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/87/68/a5.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/8c/f8/32.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/8c/f8/3d.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 3-99"
        },
        {
          "svg": "",
          "name": "Duration: 5–6 hours"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "Hotel pickup and drop-off by a private vehicle.Professional English speaking tour guide.Private transportation with air conditionMineral water during the tour.All TaxesMonuments entrance permit and fees (Total 1800 Rupees per person)Personal Expenses, Any meals and drinks.Gratuities for guide and driver.Entry/Admission - Bhaktapur Durbar SquareEntry/Admission - 55 Window Palace"
        },
        {
          "title": "What to expect",
          "text": ""
        },
        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.We will pick up from your hotel inside Kathmandu City (Ringroad).Hotel pickup is offered. View the hotel list on our checkout page to see if yours is included among the pickup points.Returns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleStroller accessibleNear public transportationInfants must sit on laps"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingFrom Nagarkot, mountain views are only visible when the weather is clear and without clouds.For Sunrise 4:30AM is best and For Sunset 1:00PM is best.Most travelers can participateThis experience requires good weather. If it’s canceled due to poor weather, you’ll be offered a different date or a full refundThis is a private tour/activity. Only your group will participate"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "FAQ",
          "text": "55 Window PalaceBhaktapur Durbar SquareNyatapola TempleDattatreya TemplePottery Square"
        },
        {
          "title": "Help",
          "text": ""
        }
      ],
      "itinerary": [
        {
          "title": "Pass by",
          "text": "Stop: 2 hours - Admission excluded"
        },
        {
          "title": "Bhaktapur Durbar Square",
          "text": "Stop: 30 minutes - Admission excluded"
        },
        {
          "title": "55 Window Palace",
          "text": "Stop: 30 minutes  "
        },
        {
          "title": "Nyatapola Temple",
          "text": "Stop: 30 minutes  "
        },
        {
          "title": "Pottery Square",
          "text": "Stop: 30 minutes  "
        },
        {
          "title": "Dattatreya Temple",
          "text": "Stop: 60 minutes  "
        },
        {
          "title": "Nagarkot",
          "text": "Stop: 30 minutes  "
        },
        {
          "title": "Nagarkot View Tower",
          "text": ""
        },
        {
          "title": "You'll return to the starting point",
          "text": ""
        }
      ],
      "reviews": [
        {
          "name": "Ahmed A",
          "text": "I had a lovely day today with Kessar, a very friendly and extremely knowledgeable guide who explained in detail a lot of the things that we saw as we drove to our destination. The weather wasn't ideal today, but we still managed to see some peaks of the Himalayas. Then we went to the ancient city of Bhaktapur, where Kessar guided me through the parts, along with teachings of the local traditions, religions, and customs. I highly recommend this trip! "
        },
        {
          "name": "Lance J",
          "text": "No doubt the most stunning combination I did in Kathmandu valley. The view from Nargakot is just amazing, we had a nice cup of tea up there as well. Bhaktapur is the most lovely city in kathmandu valley, I could spend days there just enjoying life there with the stunning architecture and warm weather. I was in Bhaktapur the day before already so the friendly guide adapted his tour a bit. We talked quite a while about the unifying of the kingdoms of Nepal and the famous knife of the Nepali military. Very interesting stories about Nepals history."
        },
        {
          "name": "PBT",
          "text": "Prashant was an excellent tour guide. He was extremely knowledgeable and was a fun addition to the sightseeing. If you’re going to visit Bhaktapur, we HIGHLY recommend booking with Prashant and his company.Also, Bhaktapur is well worth seeing. It was definitely a highlight to our Nepal trip…Thanks Prashant 🙏"
        },
        {
          "name": "Leon O",
          "text": "My tour guide was Mukesh who was excellent if you have the opportunity to do the tour with him definitely take it, he was very knowledgeable and kind. The tour was amazing, the view you get from Nagarkot was one of the best views I have seen in my life. The view of the Himalayas in contrast to the valley filled with rice and potato farms was breathtaking. The rich culture, beautiful temples and wood carvings of Bahktapur was well worth it. I can recommend this tour as it is one I will not forget."
        },
        {
          "name": "Leonbruno",
          "text": "On a three day stop over in Kathmandu I was so busy figuring out visas for India that I almost gave up on seeing the Himalaya mountain ranges until I found this trip.  Ask for KESHAR he’s a knowledgeable and sensitive guide, senior and who doesn’t just tell you dates and names, he brings you into the stories.  Would rebook it tomorrow. Thanks!"
        }
      ],
      "rate": "5.059 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d12577594-Bhaktapur_and_Nagarkot_Day_Tour_From_Kathmandu-Kathmandu_Kathmandu_Valley_Bagmati_.html",
      "categoryId": "0"
    },
    {
      "pid": null,
      "name": "UNESCO Seven World Heritage Tour in Kathmandu",
      "price": "from $180.00 per adult (price varies by group size)",
      "location": "",
      "about": "It was my first time in Nepal and I scheduled this tour to get a thorough overview of the City's UNESCO heritage sites in the Kathmandu area.  My guide - Rabina Khadka, was nice and very knowledgeable.  She provided me with the history and significance of each place we stopped at as well as bore witness to the daily life activities of locals.  We stopped at a school where students work Thangkas and learned about the art form.  Overall the tour was an amazing learning experience and a great way to see all that Kathmandu has to offer.Hello Robert,\n\nThank you so much for this wonderful review. We are so glad to hear your experience here in Trip Advisor. We look forward to serving you again in Nepal.This was an excellent tour to experience the UNESCO World Heritage sites of the Kathmandu Valley. The guide Rabina did a wonderful job of explaining the history of the sites and has an amazing in depth knowledge of the associated legends. The tour was at a nice pace to be able to experience everything but not feel exhausted or overwhelmed. Rabina selected a wonderful restaurant for lunch that had a variety of dishes available including veggie options. I highly recommend this tour and tour guide.Hi Fred,\n\nThank you so much for taking service with us. We are glad that you loved this trip and our guide was able to give you good service and information during the trip. We are extremely looking forward to serving you again in the future. Have a wonderful time in Nepal. This tour is exactly what we wanted . The 7 places  are unique . We had a wonderful time and please ask for Rabina as your tour guide because she is an expert on the historical and arqueológical  Nepali sites . They arrive on time to pick us up at the hotel and  we had a wonderful experience that we won’t forget don’t think It is expensive because the ticket places are included and Rabina always takes care of the entrances so everything is done quickly . Also the tanka  shopping and wood carving , healing bowls with Sajan was so good he made a great healing on my spine . This is a tour you must do if you go to Nepal don’t miss it .  You will do an excellent review after you get the experience .We love it .  Thank you  Himalayan advisor , your tourist guide Rabina and your driver Abash .Hi Rita,\n\nFirst of all, thank you very much for choosing us as your tour operator while you are in Kathmandu. We are the first company to create this idea and includes all 7 heritage site in one day and this is suitable who do not have enough time in Kathmandu or for short visitors. We are glad that you have a guide Rabina for your experience. We are looking forward to serving you again in the future. Have a safe flight back to work. The most comprehensive tour of Kathmandu Valley, including 7 UNESCO World Heritage sites. Entrance fees are included (which is not the case with many other providers). The tour description clearly names the places to be visited and is very reliable. Our guide Shanti is very knowledgeable and always prepared to answer any questions one might have. There is no time pressure to move on, so that each stop on the tour can be timed according to one's interests. The place for lunch is well chosen in terms of ambiance, food / drinks (incl. draft beer) and price. We can highly recommend Himalayan Advisor as provider and Shanti as guide.Hi Taras,\n\nThank you very much for booking a trip with us. Glad to know you loved this trip with our guide Shanti and we are looking forward to serve you in the future again. Namaste!This is the one “must do” day trip while vacationing in Kathmandu, and Rabina and her driver are a large part of this recommendation.  No other tour combines all the major sites in a day.  Rabina was on time, professional, and such a pleasant and knowledgeable guide making sure if I needed more time at a site or less time at  another.  Her restaurant selection was delicious and authentic.  Her driver arrived in a clean and comfortable car and ably navigated the streets and traffic which is no small feat for Kathmandu.  Highly highly recommend this tour with Rabina!Thank you for sharing your feedback and glad to know our guide Rabina could offer you\ngood service and information. We are looking forward to serving you again in the future!\nNamaste!Wow!  What an incredible tour!  Shanti did an amazing job on this tour.  Recommend that you request her by name when making your reservation!  This tour is exactly as advertised- it is a full day, 12 hour tour that hits ALL of the major sights of the Kathmandu Valley.  Shanti also timed the sequence of the tour to ensure that we saw them right when things were best.  She was very helpful as we learned about all of the different temples, rituals, stupas, and history of the cities in the Kathmandu valley.  She also was able to adjust the tour as needed for us, when we needed to skip or add stops.  I initially questioned the price, but this tour is worth it!  Looking back and seeing what we accomplished over the span of twelve hours, it's actually quite a bargain!  Transport and entrances were all included as part of the package.  I will definitely recommend this tour and Shanti to any of my friends traveling to Kathmandu!Thank you for sharing your feedback and glad to know our guide Shanti could offer you good service and information. We are looking forward to serving you again in the future! Namaste!Tip: book this activity and you will be so happy with all you get to experience. This is a great way to see the world heritage sites and learn about their history and the local cultures. Our guide, Sarita, was a wealth of knowledge. She shared important historical information and also interesting facts about details of each of the sites. She told it in a way of storytelling that helped you understand the cultural practices and local way of life. It was so fun exploring the different areas with her. She was friendly and very accommodating to our needs. She always made sure we were okay and asked about preferences for our different visits. The major highlight of the day was seeing the Kartik Dance on Changunarayan. She tailored the experience around what was meaningful to us and happily answered our many questions along the way. She is passionate and an excellent guide. Our driver was also timely and safe, helping us get to the different locations with ease.Hi Purvi,\n\nThank you for trusting us and taking Kathmandu 7 World Heritage tour with us. Glad to know our guide Sarita, she able to offered you good service and depth historical knowledge during the tour. We love to welcome you back again to show you more beautiful Nepal in future and plz feel free to contact us again. Hope to see you again. Have a nice trip! Namaste!Loved the tour! We spent the day making our way across the city visiting the many temples and districts of Kathmandu... (The monkey temple was the favorite!) We arrived just in time to see the Royal Kumari. (Which many people missed out on!) We had a nice lunch at a temple cafe, and had some tasty homemade candy as wandered through some really interesting areas! The guide, Shanti, was VERY knowledgeable and managed to navigate us through the crowds and to rain with ease! Thank you for the spectacular tour!Hi,\n\nThank you very much for taking service with us and glad to know our guide Shanti able to offer you good service and information about the trip. we are extremely looking forward to see you again in the future. Namaste!Pankaj and his team were absolutely incredible from the moment he picked us up to the very end! He was very polite, thorough and engaging whilst sharing some lovely stories and providing us with high quality information. Would highly recommend!Hi Kishen,\n\nThank you for taking a service and sharing your feedback. we are glad to know our guide Pankaj were able to offer you good service and the information about the Heritage sites of Kathmandu. We are extremely looking forward to serve you different cities again in the future! Namaste!Great tour with the lovely Shanti tour leader. All places are worth visited. Some are still under intense renovation following 2015 earthquake. Intense but worth it if you fancy a one day see all tour! Highlight at the end of the tour: we have seen the Royal Kumari! Don’t expect a smile though. To note the tour is completed in an electric car and a professional driver!Highly recommend and try to secure the secure Shanti guide to enjoy her highly knowledgeable and professional skills as a guide!Dhan’yavāda!Hi Cyril,\n\nThank you for taking service with us and glad to know that you loved this trip including our guide Shanti. We are delighted to have a guide Shanti and happy to provide you amazing female tour guide while you are in Kathmandu. Actually we are promoting female tour guide we have 4 of them in Kathmandu that help them to stand in their own job. Love to see you again in the future and happy to offer you amazing trip again. Namaste!",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/07/2c/17/9d.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/07/2c/17/bd.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/07/2b/6c/87.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 11-65"
        },
        {
          "svg": "",
          "name": "Duration: 12h"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "Private vehicleEnglish Speaking GuideAll required entry fee in 7 Heritage sites.Hotel pick up and drop off.Entry/Admission - Swayambhunath TempleEntry/Admission - Amideva Buddha ParkEntry/Admission - Kumari ChowkEntry/Admission - Durbar (Central) SquareEntry/Admission - Golden Temple (Hiranya Varna Mahavihar)Entry/Admission - Patan MuseumEntry/Admission - Nyatapola TempleEntry/Admission - Dattatreya TempleEntry/Admission - 55 Window PalaceEntry/Admission - Siddha PokhariEntry/Admission - Changu NarayanEntry/Admission - Pashupatinath TempleEntry/Admission - Boudhanath StupaLunch in Bhaktapur (your choice of many great eateries are available)Tips & Gratuities"
        },
        {
          "title": "What to expect",
          "text": ""
        },
        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.We pick up our all travelers from their hotel inside Ring road including Bouddha area. Please do provide your hotel name for pick up location.Hotel pickup is offered. View the hotel list on our checkout page to see if yours is included among the pickup points.Returns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleStroller accessibleNear public transportation"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingDress code is smart casualNot recommended for pregnant travelersNo heart problems or other serious medical conditionsMost travelers can participateThis is a private tour/activity. Only your group will participate"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "Covid safety",
          "text": "Regular temperature checks for staffRegularly sanitized high-traffic areasTemperature checks for tour participants upon arrivalGear/equipment sanitized between useFace masks required for travelers in public areasFace masks provided for travelersGuides required to regularly wash handsHand sanitizer available to travelers and staffTransportation vehicles regularly sanitizedContactless payment for gratuities and add-onsFace masks required for guides in public areasPaid stay-at-home policy for staff with symptomsSocial distancing enforced throughout experienceSafety precautions are provided by the property and are not checked by Tripadvisor for accuracy."
        },
        {
          "title": "FAQ",
          "text": "Changu NarayanKumari ChowkPashupatinath TemplePatan MuseumDurbar (Central) Square"
        },
        {
          "title": "Help",
          "text": ""
        }
      ],
      "itinerary": [
        {
          "title": "Pass by",
          "text": "Stop: 15 minutes - Admission included"
        },
        {
          "title": "Swayambhunath Temple",
          "text": "Stop: 10 minutes - Admission included"
        },
        {
          "title": "Amideva Buddha ParkPass by",
          "text": "Stop: 10 minutes - Admission included"
        },
        {
          "title": "Kumari ChowkPass by",
          "text": "Stop: 25 minutes - Admission included"
        },
        {
          "title": "Durbar (Central) Square",
          "text": "Stop: 10 minutes - Admission included"
        },
        {
          "title": "Golden Temple (Hiranya Varna Mahavihar)",
          "text": "Stop: 15 minutes - Admission included"
        },
        {
          "title": "Patan MuseumPass by",
          "text": "Stop: 10 minutes - Admission included"
        },
        {
          "title": "Nyatapola Temple",
          "text": "Stop: 10 minutes - Admission included"
        },
        {
          "title": "Dattatreya Temple",
          "text": "Stop: 10 minutes - Admission included"
        },
        {
          "title": "55 Window Palace",
          "text": "Stop: 5 minutes - Admission included"
        },
        {
          "title": "Siddha Pokhari",
          "text": ""
        }
      ],
      "reviews": [
        {
          "name": "Rob P",
          "text": "It was my first time in Nepal and I scheduled this tour to get a thorough overview of the City's UNESCO heritage sites in the Kathmandu area.  My guide - Rabina Khadka, was nice and very knowledgeable.  She provided me with the history and significance of each place we stopped at as well as bore witness to the daily life activities of locals.  We stopped at a school where students work Thangkas and learned about the art form.  Overall the tour was an amazing learning experience and a great way to see all that Kathmandu has to offer.Hello Robert,\n\nThank you so much for this wonderful review. We are so glad to hear your experience here in Trip Advisor. We look forward to serving you again in Nepal."
        },
        {
          "name": "faroutandabout",
          "text": "This was an excellent tour to experience the UNESCO World Heritage sites of the Kathmandu Valley. The guide Rabina did a wonderful job of explaining the history of the sites and has an amazing in depth knowledge of the associated legends. The tour was at a nice pace to be able to experience everything but not feel exhausted or overwhelmed. Rabina selected a wonderful restaurant for lunch that had a variety of dishes available including veggie options. I highly recommend this tour and tour guide.Hi Fred,\n\nThank you so much for taking service with us. We are glad that you loved this trip and our guide was able to give you good service and information during the trip. We are extremely looking forward to serving you again in the future. Have a wonderful time in Nepal. "
        },
        {
          "name": "Rita M",
          "text": "This tour is exactly what we wanted . The 7 places  are unique . We had a wonderful time and please ask for Rabina as your tour guide because she is an expert on the historical and arqueológical  Nepali sites . They arrive on time to pick us up at the hotel and  we had a wonderful experience that we won’t forget don’t think It is expensive because the ticket places are included and Rabina always takes care of the entrances so everything is done quickly . Also the tanka  shopping and wood carving , healing bowls with Sajan was so good he made a great healing on my spine . This is a tour you must do if you go to Nepal don’t miss it .  You will do an excellent review after you get the experience .We love it .  Thank you  Himalayan advisor , your tourist guide Rabina and your driver Abash .Hi Rita,\n\nFirst of all, thank you very much for choosing us as your tour operator while you are in Kathmandu. We are the first company to create this idea and includes all 7 heritage site in one day and this is suitable who do not have enough time in Kathmandu or for short visitors. We are glad that you have a guide Rabina for your experience. We are looking forward to serving you again in the future. Have a safe flight back to work. "
        },
        {
          "name": "TG",
          "text": "The most comprehensive tour of Kathmandu Valley, including 7 UNESCO World Heritage sites. Entrance fees are included (which is not the case with many other providers). The tour description clearly names the places to be visited and is very reliable. Our guide Shanti is very knowledgeable and always prepared to answer any questions one might have. There is no time pressure to move on, so that each stop on the tour can be timed according to one's interests. The place for lunch is well chosen in terms of ambiance, food / drinks (incl. draft beer) and price. We can highly recommend Himalayan Advisor as provider and Shanti as guide.Hi Taras,\n\nThank you very much for booking a trip with us. Glad to know you loved this trip with our guide Shanti and we are looking forward to serve you in the future again. Namaste!"
        },
        {
          "name": "Susan D",
          "text": "This is the one “must do” day trip while vacationing in Kathmandu, and Rabina and her driver are a large part of this recommendation.  No other tour combines all the major sites in a day.  Rabina was on time, professional, and such a pleasant and knowledgeable guide making sure if I needed more time at a site or less time at  another.  Her restaurant selection was delicious and authentic.  Her driver arrived in a clean and comfortable car and ably navigated the streets and traffic which is no small feat for Kathmandu.  Highly highly recommend this tour with Rabina!Thank you for sharing your feedback and glad to know our guide Rabina could offer you\ngood service and information. We are looking forward to serving you again in the future!\nNamaste!"
        }
      ],
      "rate": "5.089 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d13774467-UNESCO_Seven_World_Heritage_Tour_in_Kathmandu-Kathmandu_Kathmandu_Valley_Bagmati_Z.html",
      "categoryId": "0"
    },
    {
      "pid": null,
      "name": "Nagarkot Sunrise and Bhaktapur Durbar Squar UNESCO Tour",
      "price": "from $75.00 per adult (price varies by group size)",
      "location": "",
      "about": "We did another trip with agency. Mr. Prakash suggest to go Nagarkot hill to see sunrise view include clear himalayas and same day we did Bhaktapur Durbar Square UNESCO Tour. Our guide Prakash Aryal was really knowledgeable and experience guide in Kathmandu. We decide will do another trip with Prakash for next trip to Nepal in 2023. Our next plan is Pokhara, Chitwan and Lumbani Tour.Thank you very much for your precious words about your trip to Nagarkot sunrise and Bhaktapur Durbar Square UNESCO Tour. Hope we will get chance to serve your next trip to Nepal. Hurry to welcome you to Nepal for next trip soon. Namaste 🙏.Prakash is a very professional and helpful tour guide. Throughout the day, he patiently explained the history and meaning of the different buildings at the UNESCO heritage sites. Despite a last minute request, he extended his time and arranged for transportation to bring me to Swayambhu Temple for a tour. He had also helped to take nice photos of me throughout the tour. My friend and I really enjoyed the trip because of his professionalism as a tour guide. Will surely reach out to him again if we visit Nepal next time!Thank you so much for your valuable time with us for trip to Nepal. You will give us chance to serve your next trip to Nepal with us. Thank you for your precious words on our behalf.  Namaste .This was a great tour! Prakash was my tour guide, and he provided tons of interesting information and history throughout the tour. I was traveling alone and felt safe with Prakash and the driver the whole time. The sunrise at Nagarkot was beautiful, and I really enjoyed walking around Bhaktapur. Some highlights for me were pottery square and the Lama Thanka Painting School. Highly recommend!Thank you so much for your precious words on our behalf Shannon. We hope you enjoyed from trip. Hope you will give us chance again to serve your next trip to Nepal . Namaste 🙏 It was a very good and memorable experience with Attractive tours and travels.Mr Prakash was very professional in managing the itenary, gave proper guidance.Overall a good nice trip of kathmandu with nice people around.Thank you so much for your precious words on our behalf.  I hope we will get chance to serve your next trip to Nepal soon. Namaste 🙏 Our guide Prakash was gentle and knowledgeable as he led us on this tour.  As were rode up the the viewing area he shared about the area of Katmandu and also shared about his personal life.  As we came across places of interest that were not mentioned in the tour description we were able to make extra stops of personal interest.  As a teacher it was special to see a school in Nepal. Prakash and our driver Som were very accommodating.  Thank you to you both!Thank you so much for your precious words recommendation review on our behalf. We are happy to get chance to serve your trip to Nepal. Yes Prakash was happy to assist you as tour guide. Hope we will get chance to serve your next trip to Nepal soon. Namaste.Stunning view of sunrise 🌅 and snow mountains from this tour with Attractive Travels and Tours. Our guide Nara was excellent.  He tell us about nature, culture and religion. We bought beautiful thanking paintings from paintings school in Bhaktapur. So highly recommend to all for your any trips to Nepal with this agency.Thank you so much for your precious review writing on our behalf. Hope you will give us chance to serve your next trip to Nepal with Attractive Travels and Tours and team. I booked Nagarkot sunrise and Bhaktapur Durbar Square UNESCO day tour with this agency. Prakash make my trip stunning. This is good place to see sunrise and Himalayas views. So highly this agency with Prakash Aryal for your Nepal trip.Thank you so much for your precious words on our behalf. Namaste 🙏 Best-in-class one-day tour and outstanding tour guide in Kathmandu. Prakash has amazingly deep understanding of Nepal history and culture. He can answer any question you have about this country. He has great passion and love of the city and people here. Today we see the full moon and fabulous sunrise at the same time. The Himalaya can be seen clearly from the Nagarkot. Highly recommended for anyone traveling alone or with friends.Thank you so much for your valuable words on our behalf.  We hope you enjoyed from trip and you will give us chance to serve your next trip to Nepal again. Namaste 🙏 Did Nagarkot Sunrise, Bhaktapur UNESCO Tour , Kathmandu valley UNESCO Tour and Everest flight with this agency. Best and renounce tour and travel agency based in Kathmandu Nepal. Highly recommend to all for your any kind of trip to Nepal.Thank you so much for your valuable words. Hope you will offer us to serve your next trip to Nepal.  Namaste 🙏. We had all day out of Kathmandu. It wss very good walk tour with some amazing views, monuments and in the end we visited Bhaktupar which was the best for me. I really recommend it for people who want good day out of busy city.Thank you so much for your precious words. Hope you will offer us to serve your next trip to Nepal.  Namaste 🙏. ",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/10/3d/c1/60.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/10/3d/c1/68.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/10/3f/63/fa.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 1-99"
        },
        {
          "svg": "",
          "name": "Duration: 5–7 hours"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "All the transportation as per the itinerary.A professional tour guide.An assistant guide for more than 15 pax.Visit Thanka Panting School in Bhaktapur. Foods.Entry fee in Bhaktapur Durbar Squar UNESCO Site.Tips for your guide and driver.Entry/Admission - Bhaktapur Durbar SquareEntry/Admission - Dattatreya TempleEntry/Admission - Nyatapola Temple"
        },
        {
          "title": "What to expect",
          "text": ""
        },
        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.The travelers are picked up from hotel or Tribhuvan Airport, Kathmandu Nepal. According with their comfortable place.Airports:Tribhuvan Airport, Kathmandu NepalHotel pickup is offered. View the hotel list on our checkout page to see if yours is included among the pickup points.Returns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleInfants must sit on laps"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingNo heart problems or other serious medical conditionsMost travelers can participateThis is a private tour/activity. Only your group will participate"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "FAQ",
          "text": "Bhaktapur Durbar SquareNyatapola TempleDattatreya TemplePottery SquareNagarkot View Tower"
        },
        {
          "title": "Help",
          "text": ""
        }
      ],
      "itinerary": [
        {
          "title": "Nagarkot View Tower",
          "text": "Stop: 2 hours - Admission excluded"
        },
        {
          "title": "Bhaktapur Durbar Square",
          "text": "Stop: 20 minutes - Admission excluded"
        },
        {
          "title": "Dattatreya Temple",
          "text": "Stop: 20 minutes - Admission excluded"
        },
        {
          "title": "Nyatapola Temple",
          "text": "Stop: 20 minutes  "
        },
        {
          "title": "Pottery Square",
          "text": "Stop: 30 minutes  "
        },
        {
          "title": "Nagarkot Buddha Peace Park Hiking Trail",
          "text": ""
        },
        {
          "title": "You'll return to the starting point",
          "text": ""
        }
      ],
      "reviews": [
        {
          "name": "Lajir Kplan",
          "text": "We did another trip with agency. Mr. Prakash suggest to go Nagarkot hill to see sunrise view include clear himalayas and same day we did Bhaktapur Durbar Square UNESCO Tour. Our guide Prakash Aryal was really knowledgeable and experience guide in Kathmandu. We decide will do another trip with Prakash for next trip to Nepal in 2023. Our next plan is Pokhara, Chitwan and Lumbani Tour.Thank you very much for your precious words about your trip to Nagarkot sunrise and Bhaktapur Durbar Square UNESCO Tour. Hope we will get chance to serve your next trip to Nepal. Hurry to welcome you to Nepal for next trip soon. Namaste 🙏."
        },
        {
          "name": "Zoe Ng",
          "text": "Prakash is a very professional and helpful tour guide. Throughout the day, he patiently explained the history and meaning of the different buildings at the UNESCO heritage sites. Despite a last minute request, he extended his time and arranged for transportation to bring me to Swayambhu Temple for a tour. He had also helped to take nice photos of me throughout the tour. My friend and I really enjoyed the trip because of his professionalism as a tour guide. Will surely reach out to him again if we visit Nepal next time!Thank you so much for your valuable time with us for trip to Nepal. You will give us chance to serve your next trip to Nepal with us. Thank you for your precious words on our behalf.  Namaste ."
        },
        {
          "name": "Shannon K",
          "text": "This was a great tour! Prakash was my tour guide, and he provided tons of interesting information and history throughout the tour. I was traveling alone and felt safe with Prakash and the driver the whole time. The sunrise at Nagarkot was beautiful, and I really enjoyed walking around Bhaktapur. Some highlights for me were pottery square and the Lama Thanka Painting School. Highly recommend!Thank you so much for your precious words on our behalf Shannon. We hope you enjoyed from trip. Hope you will give us chance again to serve your next trip to Nepal . Namaste 🙏 "
        },
        {
          "name": "MAHESH C",
          "text": "It was a very good and memorable experience with Attractive tours and travels.Mr Prakash was very professional in managing the itenary, gave proper guidance.Overall a good nice trip of kathmandu with nice people around.Thank you so much for your precious words on our behalf.  I hope we will get chance to serve your next trip to Nepal soon. Namaste 🙏 "
        },
        {
          "name": "Tricia W",
          "text": "Our guide Prakash was gentle and knowledgeable as he led us on this tour.  As were rode up the the viewing area he shared about the area of Katmandu and also shared about his personal life.  As we came across places of interest that were not mentioned in the tour description we were able to make extra stops of personal interest.  As a teacher it was special to see a school in Nepal. Prakash and our driver Som were very accommodating.  Thank you to you both!Thank you so much for your precious words recommendation review on our behalf. We are happy to get chance to serve your trip to Nepal. Yes Prakash was happy to assist you as tour guide. Hope we will get chance to serve your next trip to Nepal soon. Namaste."
        }
      ],
      "rate": "5.030 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d20187061-Nagarkot_Sunrise_and_Bhaktapur_Durbar_Squar_UNESCO_Tour-Kathmandu_Kathmandu_Valley.html",
      "categoryId": "0"
    },
    {
      "pid": null,
      "name": "3-Day Chitwan National Park Jungle Safari Tour Package with Pick Up",
      "price": "from $190.00 per adult",
      "location": "",
      "about": "Great way to see Chitwan and the wildlife Nepal has to offer. The booking and whole trip was a very smooth process with great communication via WhatsApp. The bus was very clean and comfortable, the accommodation was beautiful and every meal (buffet style) was very good. Well designed activities and we were even lucky enough to see the Bengal tiger! Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.We loved this trip. Communication was perfect from the start until the end, we could ask anything. The accommodation was excellent, with very good service. The staff was very friendly, the room very comfortable and clean, the food delicious. They helped us with everything we needed. The activities were very interesting: we saw rhino’s, crocodiles and other wildlife. The jungle walk was very exciting and relaxing at the same time. The visit of the elephant breeding centre was lovely, they take very good care of them. We had a kind and well-informed English-speaking local guide who answered all our questions. We would recommend this trip to everyone!Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.I had booked my family tour 2 nights 3 days chitwan jungle safari tour through Welcome Nepal Treks & Tours Pvt. Ltd. All program was nice and well management. Thanks for well organizing.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.It was a lovely trip and we had such a luck to saw a tiger! That was amazing. But the trip is not a 3 day trip, you have to go so far by bus that you have only 1,5 days at the national park. The hotel was nothing… 4stars but not in a good mood, bathroom very muddy, towels not clean, very loud!Guides are friendly and helpfulDear Guest, Namaste! Thank you so much for this  review and suggestion. About the day bus drive from kathmandu to chitwan its taking some time longer some time just 5 hour because of the construction. Hope soon in future no more takes 5 hours. About the hotel we are changing.  We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Very relaxing trip. Tour organiser was very proactive in making sure I was ok and happy. The coach down was relaxing and beautiful scenery. Chitwan is lovely got to see some great wildlife. resort and room was great too. Food was tasty and they even gave me extras if I wasn't full.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.If you want to spend the best time in Nepal without any worries,  Welcome Nepal Treks should be your first choice. Their Chitwan National Park Jungle safari package will not only give you a pleasant time, it will make your trip memorable for a lifetime. They have trained guides, excellent transport services and great hotels. If you want, there is also a tailoring system in their packages. They will always give you their best service. And I believe you will want to take their service again and again. I took their 3 days safari package, now I still want to travel with them. This Chitwan safari will be one of the best trips of my life.Dear Guest, Thank you very much for sharing your experience about the Chitwan Jungle safari tour. Its makes us more responsible in the future to organize better service and make client more happy.\nWish you all the best hope to see you next time. Thank you, Hari \nThere is a lot to see in just three short days. The crocodile tour was amazing as was the safrai. There is a sense that anything can happen even just a few meters from the town center. The hotel I was staying at had excellent service and great rooms. Eco resort is a fantastic tour company who took care of everything and if I had an issue responded quickly and resolved it. Hari is an incredible person and very hard working. I highly recommend booking this tour with this companyDear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.5/5 for the hotel, safari club, and experience in Chitwan.The staff at the hotel was very friendly and the food was good. Tours were fun and the dance performance was nice. Definitly worth the money. 3/5 for the ride there, there are road maintenances the whole way and the bus driver puts you in the back of the bus at the worst seats.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Chitwan Wildlife Safari tour was my right decision to visit after tough trekking in Annapurna trek.After completing the ABC trek, we did Wildlife Jungle Safari in Chitwan National Park. We see many birds, crocodile, Rhinoceros, many deer and other wild animals. We did not see any tiger. The accommodations are great and the provided meals were just perfect. The food and room was nice. Chitwan is one of the best place.Chitwan National park is really beautiful. Chitwan National Park is one of the best places to visit in your vacation. Dear Guest, Thank you very much for sharing your experience about the Chitwan Jungle safari tour. Its makes us more responsible in the future to organize better service and make client more happy.\nWish you all the best hope to see you next time. Thank you, Hari \nWe had a great 3 day safari. The pick up options were extremely helpful and our guide was able to help us get to the correct bus and then back to our hotel after the safari was over. Our hotel in Chitwan was awesome, the food was good and our local guide was very knowledgeable. We were able to see countless birds, 2 rhinos, lots of crocodiles, monkeys and even wild boar. For us, the highlight was the canoe ride!Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/0e/f3/c4/df.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/0e/f3/c5/12.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/0e/f3/c5/15.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 5-99, max of 25 per group"
        },
        {
          "svg": "",
          "name": "Duration: 3 days"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "German, English, Italian, French, Spanish"
        },
        {
          "svg": "",
          "name": "Features animals"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "LunchBreakfastBreakfastDinnerLunchDinnerKathmandu -Chitwan -Kathmandu transfers by Tourist bus National Park Fee Entry/Admission - Chitwan Tharu VillagePersonal expenses (Tips, beverage, laundry, telephone call, etc) "
        },
        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.Departure from Kathmandu. We pick up from your hotel. Departure Time: 6:00 AM Airports:Tribhuvan Airport, Kathmandu NepalHotel pickup is offered. View the hotel list on our checkout page to see if yours is included among the pickup points.Returns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleStroller accessibleService animals allowedNear public transportationInfant seats available"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingNo heart problems or other serious medical conditionsMost travelers can participateThis tour/activity will have a maximum of 25 travelers"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "Covid safety",
          "text": "Regular temperature checks for staffRegularly sanitized high-traffic areasGuides required to regularly wash handsHand sanitizer available to travelers and staffTransportation vehicles regularly sanitizedContactless payment for gratuities and add-onsFace masks required for guides in public areasGear/equipment sanitized between useFace masks required for travelers in public areasFace masks provided for travelersSafety precautions are provided by the property and are not checked by Tripadvisor for accuracy."
        },
        {
          "title": "FAQ",
          "text": "Chitwan Tharu Village"
        },
        {
          "title": "Help",
          "text": ""
        }
      ],
      "itinerary": [],
      "reviews": [
        {
          "name": "Ryan M",
          "text": "Great way to see Chitwan and the wildlife Nepal has to offer. The booking and whole trip was a very smooth process with great communication via WhatsApp. The bus was very clean and comfortable, the accommodation was beautiful and every meal (buffet style) was very good. Well designed activities and we were even lucky enough to see the Bengal tiger! Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Annelies S",
          "text": "We loved this trip. Communication was perfect from the start until the end, we could ask anything. The accommodation was excellent, with very good service. The staff was very friendly, the room very comfortable and clean, the food delicious. They helped us with everything we needed. The activities were very interesting: we saw rhino’s, crocodiles and other wildlife. The jungle walk was very exciting and relaxing at the same time. The visit of the elephant breeding centre was lovely, they take very good care of them. We had a kind and well-informed English-speaking local guide who answered all our questions. We would recommend this trip to everyone!Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Phulmaya M",
          "text": "I had booked my family tour 2 nights 3 days chitwan jungle safari tour through Welcome Nepal Treks & Tours Pvt. Ltd. All program was nice and well management. Thanks for well organizing.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Judith M",
          "text": "It was a lovely trip and we had such a luck to saw a tiger! That was amazing. But the trip is not a 3 day trip, you have to go so far by bus that you have only 1,5 days at the national park. The hotel was nothing… 4stars but not in a good mood, bathroom very muddy, towels not clean, very loud!Guides are friendly and helpfulDear Guest, Namaste! Thank you so much for this  review and suggestion. About the day bus drive from kathmandu to chitwan its taking some time longer some time just 5 hour because of the construction. Hope soon in future no more takes 5 hours. About the hotel we are changing.  We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Campbell W",
          "text": "Very relaxing trip. Tour organiser was very proactive in making sure I was ok and happy. The coach down was relaxing and beautiful scenery. Chitwan is lovely got to see some great wildlife. resort and room was great too. Food was tasty and they even gave me extras if I wasn't full.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        }
      ],
      "rate": "5.070 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d24081739-3_Day_Chitwan_National_Park_Jungle_Safari_Tour_Package_with_Pick_Up-Kathmandu_Kath.html",
      "categoryId": "0"
    },
    {
      "pid": null,
      "name": "Day Trip to Bhaktapur and Panauti from Kathmandu",
      "price": "from $34.00 per adult",
      "location": "",
      "about": "Overall the place is definitely mesmerizing. However my guide didn't seem to have much to say about these places. Felt like we were just strolling through and getting it done. They advertised to finish the trip at 6:15pm but  was actually asked to leave with them around 4:30pm. I reasoned and wanted to spend more time there then they did stretch it to 5pm... So I let him go and stayed back on my own. Took a ride at my own expense and went back. Overall I felt like I could have just been with myself and had a better time. More like I paid for transportation, that too was one way only. Wouldn't recommend based on my experience.Was a great intimate tour of two culturally significant Nepali cities. The tour also provided a wonderful insight to Newari culture (the local people). The guide was very insightful and knowledgeable - their excitement and love for their city was amazing. Would recommend for travellers looking to explore these two cities!We had a wonderful tour to the Unesco site Bhaktapur and quiet old town Panauti with guide Dilip Shakya and driver Shanti Ghisting.Dilip’s knowledge of Nepalese history and culture was above our expectations.it was the last and the best day during our visit to Kathmandu and we highly recommend this tour to travelers. We liked Royal mountain travel company - everything was very well organized and guide Dilip and driver Shanti made our trip unforgettable.Thank you!Steven and IrinaDear Guest,\n\nThank you for taking the time to leave such a kind review of your experience with us. We're thrilled to hear that you had a wonderful time on your tour to Bhaktapur and Panauti with our guide Dilip Shakya and our Road Captain Shanti Ghisting.\n\nIt's fantastic to hear that Dilip's knowledge of Nepalese history and culture exceeded your expectations and that this tour was the highlight of your visit to Kathmandu. \n\nThank you for choosing Royal Mountain Travel Company for your travels, and we hope to have the pleasure of welcoming you back on another adventure in the future.\n\nThank you,This was a very nice day tour. My guide was excellent and explained things very clearly.  I had time to look without feeling hurried which I appreciate. I would recommend this tour to anyone who wants a hassle free experience while visiting NepalI had the most incredible time on my tours with Royal Mountain Travel.  My tour guide (and the tour company itself) were both professional, extremely knowledgeable, courteous, and hospitable. I loved both towns so much.  They were deep and rich with history, so fascinating to learn about them and the rich culture. I loved the food, the local arts and crafts, the temples and architecture...all of it!  Just a wonderful country in general but this tour company and my tour guide really made it that much more wonderful!  I cannot wait to go back and do another tour with them!Dear Guest,\n\nThank you very much for choosing Royal Mountain Travel. Many thanks for your lovely review! We aim to delight our customer every time and we’re pleased that we were able to meet your expectations. Naturally and Culturally rich, Nepal once is not enough. Therefore, looking forward to serve you again in the near future. \n\nBest Regards, Dilip is a very sympathetic and knowledgeable tour guide with many insider's tips, e.g. for interesting/special Panauti places (only few tourists get to see these) or for the best Juju Dhau Joghurt in town. Reliable transport with cold water available. Highly recommended trip for tourists interested in Nepal/Bhaktapur/Panauti.Dear Guest, \nGreetings!!!\n\nWe are happy that you found our services well, and thank you very much for your kind words and excellent review.\n\nBest RegardsGuides are a must to understand this fascinating medieval city.  As in most UNESCO sites, street vendors are as thick as soup. No to them means maybe, if they persist enough, so just ignore them. If you buy one trinket, they will be on you like locusts for more. Public toilets are filthy. Carry your own toilet paper. You probably do not want to sit down, so try to go before you get there.Dear Guest,\nGreetings!!!\n\nThank you for sharing the information. We are grateful for the amount of time and effort you put into helping us. Your insights and summary are beneficial for us and our guest.\n\nBest WishesWe had an outstanding day thanks to Dilip and the driver (sorry, name forgotten, but she was great at taking advantage of the narrowest gap and keeping us going despite the busy lead up to the festival)!Unique and unmissable experience in the rural town of Panauti, learning about the Hindu deities and understanding the meaning and history of the temples, and then walking around after the rice has been harvested watching the sifting and dryng in the open spaces.Then the classic tour around the amazing Bhaktapur, seeing historic monuments and the royal palace, though disappointed that as non-Hindus we were not allowed into the central courtyard of the palace. We were surprised by an impromptu course in pottery and also in Thanka painting.Not to forget a great Newari lunch with local specialities known to Dilip and very well chosen and explained by him, and rice beer!Full marks for a great experience and for Dilip responding to our interest, and fit making us feel so welcome.I enjoyed visiting both destinations. I learned a lot about Nepal and it's people from my guide, who was very knowledgeable.Bhaktapur Durbar is extremely fascinating and definitely worth a visit. I didn't know about Panauti as all, and was also positively surprised. It is a traditional, tranquil Newari town, where you can escape the hassle of the big city.Overall, fully recommended :)We really enjoyed our tour to Bhaktapur and Panauti. The drive was very comfortable and we enjoyed looking round Bhaktapur despite the rain. Our guide, Akshay, was very knowledgeable about the history of the area and knew lots of stories too. He taloured the tour to our interests, trying some Juju Dhau and pottery making!Lunch at our homestay was delicious and included trying our hand at some cooking!Thank you!",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/06/7b/24/d4.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/a6/59/14.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/a6/56/ea.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 0-90, max of 10 per group"
        },
        {
          "svg": "",
          "name": "Duration: 7h"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "English-speaking tour guideTransport by air conditioned vehicle as per group sizeHotel pickup and drop-offLunchAll Fees and TaxesEntry/Admission - Bhaktapur Durbar SquareEntry/Admission - Panauti"
        },
        {
          "title": "What to expect",
          "text": ""
        },
        {
          "title": "Departure and return",
          "text": "Royal Mountain Travel, Lal Durbar Marg, Kathmandu 44601, Nepal\nReturns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Not wheelchair accessibleNear public transportationInfant seats available"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingEntrance fee is applicable to children 10 years and abovePlease be informed that, entrance fee is not includedMost travelers can participateThis tour/activity will have a maximum of 10 travelers"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "Covid safety",
          "text": "Regular temperature checks for staffRegularly sanitized high-traffic areasTemperature checks for tour participants upon arrivalGuides required to regularly wash handsHand sanitizer available to travelers and staffTransportation vehicles regularly sanitizedContactless payment for gratuities and add-onsFace masks required for guides in public areasPaid stay-at-home policy for staff with symptomsGear/equipment sanitized between useFace masks required for travelers in public areasSocial distancing enforced throughout experienceFace masks provided for travelersSafety precautions are provided by the property and are not checked by Tripadvisor for accuracy."
        },
        {
          "title": "FAQ",
          "text": "Bhaktapur Durbar Square"
        },
        {
          "title": "Help",
          "text": ""
        }
      ],
      "itinerary": [
        {
          "title": "Bhaktapur Durbar Square",
          "text": "Stop: 3 hours - Admission excluded"
        },
        {
          "title": "Panauti Community Home Stay",
          "text": ""
        },
        {
          "title": "You'll return to the starting point",
          "text": ""
        }
      ],
      "reviews": [
        {
          "name": "Tanvi",
          "text": "Overall the place is definitely mesmerizing. However my guide didn't seem to have much to say about these places. Felt like we were just strolling through and getting it done. They advertised to finish the trip at 6:15pm but  was actually asked to leave with them around 4:30pm. I reasoned and wanted to spend more time there then they did stretch it to 5pm... So I let him go and stayed back on my own. Took a ride at my own expense and went back. Overall I felt like I could have just been with myself and had a better time. More like I paid for transportation, that too was one way only. Wouldn't recommend based on my experience."
        },
        {
          "name": "Kevin S",
          "text": "Was a great intimate tour of two culturally significant Nepali cities. The tour also provided a wonderful insight to Newari culture (the local people). The guide was very insightful and knowledgeable - their excitement and love for their city was amazing. Would recommend for travellers looking to explore these two cities!"
        },
        {
          "name": "Steven / Irina",
          "text": "We had a wonderful tour to the Unesco site Bhaktapur and quiet old town Panauti with guide Dilip Shakya and driver Shanti Ghisting.Dilip’s knowledge of Nepalese history and culture was above our expectations.it was the last and the best day during our visit to Kathmandu and we highly recommend this tour to travelers. We liked Royal mountain travel company - everything was very well organized and guide Dilip and driver Shanti made our trip unforgettable.Thank you!Steven and IrinaDear Guest,\n\nThank you for taking the time to leave such a kind review of your experience with us. We're thrilled to hear that you had a wonderful time on your tour to Bhaktapur and Panauti with our guide Dilip Shakya and our Road Captain Shanti Ghisting.\n\nIt's fantastic to hear that Dilip's knowledge of Nepalese history and culture exceeded your expectations and that this tour was the highlight of your visit to Kathmandu. \n\nThank you for choosing Royal Mountain Travel Company for your travels, and we hope to have the pleasure of welcoming you back on another adventure in the future.\n\nThank you,"
        },
        {
          "name": "Tim S",
          "text": "This was a very nice day tour. My guide was excellent and explained things very clearly.  I had time to look without feeling hurried which I appreciate. I would recommend this tour to anyone who wants a hassle free experience while visiting Nepal"
        },
        {
          "name": "Lynna",
          "text": "I had the most incredible time on my tours with Royal Mountain Travel.  My tour guide (and the tour company itself) were both professional, extremely knowledgeable, courteous, and hospitable. I loved both towns so much.  They were deep and rich with history, so fascinating to learn about them and the rich culture. I loved the food, the local arts and crafts, the temples and architecture...all of it!  Just a wonderful country in general but this tour company and my tour guide really made it that much more wonderful!  I cannot wait to go back and do another tour with them!Dear Guest,\n\nThank you very much for choosing Royal Mountain Travel. Many thanks for your lovely review! We aim to delight our customer every time and we’re pleased that we were able to meet your expectations. Naturally and Culturally rich, Nepal once is not enough. Therefore, looking forward to serve you again in the near future. \n\nBest Regards, "
        }
      ],
      "rate": "5.076 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d12466057-Day_Trip_to_Bhaktapur_and_Panauti_from_Kathmandu-Kathmandu_Kathmandu_Valley_Bagmat.html",
      "categoryId": "0"
    },
    {
      "pid": null,
      "name": "1 Hour Mount Everest flight from Kathmandu With Hotel Pick Up",
      "price": "from $250.00 per adult (price varies by group size)",
      "location": "",
      "about": "We were picked up promptly by our guide and driver who were so helpful and kind. We got through the airport easily. We were very lucky because two flights had to be canceled that day due to weather. It’s a once in a lifetime view of Mt. Everest. Nice crew, flight and fellow passengers. The view is heavenly. Beautiful mountain tops peaking through the clouds. We had some cloudiness then sun. I am so grateful to have seen this. Well run tour with full refund if they have to turn back. Reputable. Thank you.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Great communication and punctual. The experience is good to cover all the mountains from a viewpoint. However, make sure you don’t seat between row 5-9, as the propellant sticks out there and you might not have the best view. I was ok as I am not a social media freaks, but for good shots, you should request for thatDear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.I was wondering what to do on vacation this year. Fortunately, I got to know about the 1-hour Mount Everest Flight. I decided to join the fun, and the experience was aesthetic. I loved the whole arrangement done by Welcome Nepal Treks from itinerary to transportation. I highly recommend Welcome Nepal Treks for your next travel choice. Life is all about making great memories, Right?Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.The flight was delayed by 2 and a half hours due to the weather but I was so glad it went ahead! The views of the mountain chain to Everest were amazing! The staff on board were really helpful at pointing out which peak was which. It was over all too soon. The only negative point was that, although the notes stated that pick up and drop if were included, this was not the case. I negotiated paying only for the return taxi.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.This was one amazing trip.  This company provide an excellent service.  They turned up at 5.05 for 5.15 waited for me opened car doors and escorted me to the airport.Very professional friendly outstanding service.Will be recommending to all my friends and familyDear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Pretty nice view of the Himalayas. Flight is with a local commercial airline and plane is fairly big. It gets pretty close to the mountains, but a helicopter flight would probably have felt more personal. Driver and guide were on time and very courteous. Travel agency was great to deal with.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Highly recommended 1 hour Mount Everest Filght tour. It was the highly recommended Mount  Everest base Filght tour ride by my friends who went there. When I got time, I also did it. I could not believe the views of Everest, and other snow-capped mountains that I saw from a flight and also from Lukla, Kala Pathar, and Hotel Everest View. I still have no words to explain the beauty. I also recommend this ride to Everest base camp for all adventure travelers.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Wonderful experience. The tour operator picked me up at my hotel, had my ticket printed out and explained exactly where to go to check in. My flight was delayed two hrs due to fog and the driver waited for me. Amazing views up close to the mountains and a reliable knowledgeable tour operator. I highly recommend them.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Nice Himalayan view. Good airlines good driver Mr Deepak we really enjoy the trip of mountain flight. Thanks welcome Nepal treks team for trip. Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.Thank you very much for this nice experience. This 1 hour Mount Everest sightseeing is best. To every one who want to see the Himalayan in easy way with best price. They pick up from hotel and even drop to hotel by private transport it’s very easy trip.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks.",
      "gallery": [
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/be/f6/32.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/be/f6/48.jpg",
        "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-720x480/09/be/f6/49.jpg"
      ],
      "feature": [
        {
          "svg": "",
          "name": "Ages 5-120, max of 15 per group"
        },
        {
          "svg": "",
          "name": "Duration: 53m"
        },
        {
          "svg": "",
          "name": "Start time: Check availability"
        },
        {
          "svg": "",
          "name": "Mobile ticket"
        },
        {
          "svg": "",
          "name": "English"
        }
      ],
      "highlight": [],
      "extra": [
        {
          "title": "What's included",
          "text": "1 HRS Flight (full refundable in case of no flight)CertificateGuaranteed Window seatPick up from Kathmandu Hotel to Airport and drop off from airport to Hotel.Entry/Admission - Mount Everest"
        },
        {
          "title": "What to expect",
          "text": ""
        },
        {
          "title": "Departure and return",
          "text": "Traveler pickup is offered.Tribhuvan International Airport, Ring Rd, काठमाडौँ 44600, Nepal\nTribhuvan International AirportAirports:Tribhuvan Airport, Kathmandu NepalReturns to original departure point"
        },
        {
          "title": "Accessibility",
          "text": "Infants must sit on lapsNear public transportationStroller accessibleWheelchair accessible"
        },
        {
          "title": "Additional information",
          "text": "Confirmation will be received at time of bookingMost travelers can participateInfant seats unavailableNot suitable for petsWheelchair accessibleThis experience requires good weather. If it’s canceled due to poor weather, you’ll be offered a different date or a full refundThis tour/activity will have a maximum of 15 travelers"
        },
        {
          "title": "Cancellation policy",
          "text": "For a full refund, cancel at least 24 hours in advance of the start date of the experience."
        },
        {
          "title": "FAQ",
          "text": ""
        },
        {
          "title": "Help",
          "text": ""
        }
      ],
      "itinerary": [
        {
          "title": "Mount Everest",
          "text": ""
        },
        {
          "title": "You'll return to the starting point",
          "text": ""
        }
      ],
      "reviews": [
        {
          "name": "Marie B",
          "text": "We were picked up promptly by our guide and driver who were so helpful and kind. We got through the airport easily. We were very lucky because two flights had to be canceled that day due to weather. It’s a once in a lifetime view of Mt. Everest. Nice crew, flight and fellow passengers. The view is heavenly. Beautiful mountain tops peaking through the clouds. We had some cloudiness then sun. I am so grateful to have seen this. Well run tour with full refund if they have to turn back. Reputable. Thank you.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Ahmed A",
          "text": "Great communication and punctual. The experience is good to cover all the mountains from a viewpoint. However, make sure you don’t seat between row 5-9, as the propellant sticks out there and you might not have the best view. I was ok as I am not a social media freaks, but for good shots, you should request for thatDear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Nikita Shrestha",
          "text": "I was wondering what to do on vacation this year. Fortunately, I got to know about the 1-hour Mount Everest Flight. I decided to join the fun, and the experience was aesthetic. I loved the whole arrangement done by Welcome Nepal Treks from itinerary to transportation. I highly recommend Welcome Nepal Treks for your next travel choice. Life is all about making great memories, Right?Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Alek",
          "text": "The flight was delayed by 2 and a half hours due to the weather but I was so glad it went ahead! The views of the mountain chain to Everest were amazing! The staff on board were really helpful at pointing out which peak was which. It was over all too soon. The only negative point was that, although the notes stated that pick up and drop if were included, this was not the case. I negotiated paying only for the return taxi.Dear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        },
        {
          "name": "Mary",
          "text": "This was one amazing trip.  This company provide an excellent service.  They turned up at 5.05 for 5.15 waited for me opened car doors and escorted me to the airport.Very professional friendly outstanding service.Will be recommending to all my friends and familyDear Guest, Namaste! Thank you so much for this wonderful positive review. We are very glad to hear that you are happy with our service. We hope see you again. Best Wishes, Team of Welcome Nepal Treks."
        }
      ],
      "rate": "5.042 reviews",
      "url": "https://www.tripadvisor.com/AttractionProductReview-g293890-d19499705-1_Hour_Mount_Everest_flight_from_Kathmandu_With_Hotel_Pick_Up-Kathmandu_Kathmandu_.html",
      "categoryId": "0"
    }
  ]
}
